#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Basic.hpp"
#include "UE4_Engine_classes.hpp"
#include "UE4_GameplayAbilities_classes.hpp"
#include "UE4_AkAudio_classes.hpp"
#include "UE4_CoreUObject_classes.hpp"
#include "UE4_UMG_classes.hpp"
#include "UE4_GameplayTags_classes.hpp"
#include "UE4_AIModule_classes.hpp"
#include "UE4_InputCore_classes.hpp"
#include "UE4_OnlineSubsystemPhoenix_classes.hpp"
#include "UE4_OnlineSubsystemUtils_classes.hpp"
#include "UE4_SlateCore_classes.hpp"
#include "UE4_AnimGraphRuntime_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum Archon.EElementType
enum class EElementType : uint8_t
{
	EElementType__ElementType_PHYSICAL = 0,
	EElementType__ElementType_FLAME = 1,
	EElementType__ElementType_FROST = 2,
	EElementType__ElementType_SHOCK = 3,
	EElementType__ElementType_RADIANT = 4,
	EElementType__ElementType_UMBRAL = 5,
	EElementType__ElementType_RAW  = 6,
	EElementType__ElementType_COUNT = 7,
	EElementType__ElementType_MAX  = 8
};


// Enum Archon.EPhysicalType
enum class EPhysicalType : uint8_t
{
	EPhysicalType__PhysicalType_CUTTING = 0,
	EPhysicalType__PhysicalType_BLUNT = 1,
	EPhysicalType__PhysicalType_PIERCING = 2,
	EPhysicalType__PhysicalType_COUNT = 3,
	EPhysicalType__PhysicalType_MAX = 4
};


// Enum Archon.EQuestStatus
enum class EQuestStatus : uint8_t
{
	EQuestStatus__Unavailable      = 0,
	EQuestStatus__Accepted         = 1,
	EQuestStatus__Redeemable       = 2,
	EQuestStatus__Redeemed         = 3,
	EQuestStatus__Available        = 4,
	EQuestStatus__EQuestStatus_MAX = 5
};


// Enum Archon.EGatherableTier
enum class EGatherableTier : uint8_t
{
	EGatherableTier__Tier0         = 0,
	EGatherableTier__Tier1         = 1,
	EGatherableTier__Tier2         = 2,
	EGatherableTier__Tier3         = 3,
	EGatherableTier__Tier4         = 4,
	EGatherableTier__EGatherableTier_MAX = 5
};


// Enum Archon.EHuntBiome
enum class EHuntBiome : uint8_t
{
	EHuntBiome__Moss               = 0,
	EHuntBiome__Ice                = 1,
	EHuntBiome__Arid               = 2,
	EHuntBiome__EHuntBiome_MAX     = 3
};


// Enum Archon.EArchonCharacterCreationState
enum class EArchonCharacterCreationState : uint8_t
{
	EArchonCharacterCreationState__NewCharacter = 0,
	EArchonCharacterCreationState__FaceComplete = 1,
	EArchonCharacterCreationState__EArchonCharacterCreationState_MAX = 2
};


// Enum Archon.EArchonPresenceStatus
enum class EArchonPresenceStatus : uint8_t
{
	EArchonPresenceStatus__PresenceStatus_Online = 0,
	EArchonPresenceStatus__PresenceStatus_Offline = 1,
	EArchonPresenceStatus__PresenceStatus_Away = 2,
	EArchonPresenceStatus__PresenceStatus_ExtendedAway = 3,
	EArchonPresenceStatus__PresenceStatus_DoNotDisturb = 4,
	EArchonPresenceStatus__PresenceStatus_Chat = 5,
	EArchonPresenceStatus__PresenceStatus_MAX = 6
};


// Enum Archon.ELobbyMemberChangedReason
enum class ELobbyMemberChangedReason : uint8_t
{
	ELobbyMemberChangedReason__Disconnected = 0,
	ELobbyMemberChangedReason__Promoted = 1,
	ELobbyMemberChangedReason__Kicked = 2,
	ELobbyMemberChangedReason__LobbyDestroyed = 3,
	ELobbyMemberChangedReason__ELobbyMemberChangedReason_MAX = 4
};


// Enum Archon.EArchonPartyState
enum class EArchonPartyState : uint8_t
{
	EArchonPartyState__Idle        = 0,
	EArchonPartyState__Matchmaking = 1,
	EArchonPartyState__Matched     = 2,
	EArchonPartyState__EArchonPartyState_MAX = 3
};


// Enum Archon.EPartyMemberChangedReason
enum class EPartyMemberChangedReason : uint8_t
{
	EPartyMemberChangedReason__Disconnected = 0,
	EPartyMemberChangedReason__Promoted = 1,
	EPartyMemberChangedReason__Kicked = 2,
	EPartyMemberChangedReason__PartyDestroyed = 3,
	EPartyMemberChangedReason__EPartyMemberChangedReason_MAX = 4
};


// Enum Archon.EArmorTier
enum class EArmorTier : uint8_t
{
	EArmorTier__ArmorTier          = 0,
	EArmorTier__ArmorTier01        = 1,
	EArmorTier__ArmorTier02        = 2,
	EArmorTier__ArmorTier03        = 3,
	EArmorTier__ArmorTier04        = 4,
	EArmorTier__ArmorTier_MAX      = 5
};


// Enum Archon.EArmorType
enum class EArmorType : uint8_t
{
	EArmorType__ArmorType_HELMET   = 0,
	EArmorType__ArmorType_CHEST    = 1,
	EArmorType__ArmorType_LEGS     = 2,
	EArmorType__ArmorType_ARMS     = 3,
	EArmorType__ArmorType_NONE     = 4,
	EArmorType__ArmorType_MAX      = 5
};


// Enum Archon.EArmourDyeSurfaceType
enum class EArmourDyeSurfaceType : uint8_t
{
	EArmourDyeSurfaceType__Default = 0,
	EArmourDyeSurfaceType__Glossy  = 1,
	EArmourDyeSurfaceType__Metallic = 2,
	EArmourDyeSurfaceType__Emissive = 3,
	EArmourDyeSurfaceType__Velvet  = 4,
	EArmourDyeSurfaceType__Weathered = 5,
	EArmourDyeSurfaceType__EArmourDyeSurfaceType_MAX = 6
};


// Enum Archon.EArchonAttributeModifierType
enum class EArchonAttributeModifierType : uint8_t
{
	EArchonAttributeModifierType__Multiplicative = 0,
	EArchonAttributeModifierType__Additive = 1,
	EArchonAttributeModifierType__EArchonAttributeModifierType_MAX = 2
};


// Enum Archon.EArchonBuffStackStrategy
enum class EArchonBuffStackStrategy : uint8_t
{
	EArchonBuffStackStrategy__StackStrategy_RefreshExisting = 0,
	EArchonBuffStackStrategy__StackStrategy_IgnoreNew = 1,
	EArchonBuffStackStrategy__StackStrategy_Stack = 2,
	EArchonBuffStackStrategy__StackStrategy_Custom = 3,
	EArchonBuffStackStrategy__StackStrategy_MAX = 4
};


// Enum Archon.EArchonGameplayAbilityInputBinds
enum class EArchonGameplayAbilityInputBinds : uint8_t
{
	EArchonGameplayAbilityInputBinds__Ability1 = 0,
	EArchonGameplayAbilityInputBinds__Ability2 = 1,
	EArchonGameplayAbilityInputBinds__Ability3 = 2,
	EArchonGameplayAbilityInputBinds__Ability4 = 3,
	EArchonGameplayAbilityInputBinds__Ability5 = 4,
	EArchonGameplayAbilityInputBinds__Ability6 = 5,
	EArchonGameplayAbilityInputBinds__Ability7 = 6,
	EArchonGameplayAbilityInputBinds__Ability8 = 7,
	EArchonGameplayAbilityInputBinds__Ability9 = 8,
	EArchonGameplayAbilityInputBinds__EArchonGameplayAbilityInputBinds_MAX = 9
};


// Enum Archon.EGCNotifySubsetState
enum class EGCNotifySubsetState : uint8_t
{
	EGCNotifySubsetState__Default  = 0,
	EGCNotifySubsetState__Unloaded = 1,
	EGCNotifySubsetState__Loading  = 2,
	EGCNotifySubsetState__Loaded   = 3,
	EGCNotifySubsetState__EGCNotifySubsetState_MAX = 4
};


// Enum Archon.EGameplayOperationState
enum class EGameplayOperationState : uint8_t
{
	EGameplayOperationState__INACTIVE = 0,
	EGameplayOperationState__ACTIVE = 1,
	EGameplayOperationState__EGameplayOperationState_MAX = 2
};


// Enum Archon.EArchonInventorySlot
enum class EArchonInventorySlot : uint8_t
{
	EArchonInventorySlot__None     = 0,
	EArchonInventorySlot__Weapon   = 1,
	EArchonInventorySlot__Chest    = 2,
	EArchonInventorySlot__Helmet   = 3,
	EArchonInventorySlot__Legs     = 4,
	EArchonInventorySlot__Arms     = 5,
	EArchonInventorySlot__EArchonInventorySlot_MAX = 6
};


// Enum Archon.EQuickItemSlot
enum class EQuickItemSlot : uint8_t
{
	EQuickItemSlot__QuickItemSlot_POTION = 0,
	EQuickItemSlot__QuickItemSlot_OFFENSIVE = 1,
	EQuickItemSlot__QuickItemSlot_DEFENSIVE = 2,
	EQuickItemSlot__QuickItemSlot_FLARE = 3,
	EQuickItemSlot__QuickItemSlot_AIRSHIP = 4,
	EQuickItemSlot__QuickItemSlot_GENERIC = 5,
	EQuickItemSlot__QuickItemSlot_UNUSED = 6,
	EQuickItemSlot__QuickItemSlot_MAX = 7
};


// Enum Archon.ELoadoutQuickItemSlot
enum class ELoadoutQuickItemSlot : uint8_t
{
	ELoadoutQuickItemSlot__Slot    = 0,
	ELoadoutQuickItemSlot__Slot01  = 1,
	ELoadoutQuickItemSlot__Slot02  = 2,
	ELoadoutQuickItemSlot__Slot03  = 3,
	ELoadoutQuickItemSlot__Slot04  = 4,
	ELoadoutQuickItemSlot__Slot_Flask_Heal = 5,
	ELoadoutQuickItemSlot__Slot_Flask_Revive = 6,
	ELoadoutQuickItemSlot__Slot_Max = 7
};


// Enum Archon.ELoadScreenStyle
enum class ELoadScreenStyle : uint8_t
{
	LOAD_SCREEN_QUICK              = 0,
	LOAD_SCREEN_CITY               = 1,
	LOAD_SCREEN_ISLAND             = 2,
	LOAD_SCREEN_FTUE_ISLAND        = 3,
	LOAD_SCREEN_FTUE_CITY          = 4,
	LOAD_SCREEN_FTUE               = 5,
	LOAD_SCREEN_MAX                = 6
};


// Enum Archon.EArchonLobbyPaperDollPart
enum class EArchonLobbyPaperDollPart : uint8_t
{
	ALPDP_Head                     = 0,
	ALPDP_Chest                    = 1,
	ALPDP_Arms                     = 2,
	ALPDP_Legs                     = 3,
	ALPDP_Lantern                  = 4,
	ALPDP_Weapon                   = 5,
	ALPDP_Max                      = 6
};


// Enum Archon.EPartyInviteFilter
enum class EPartyInviteFilter : uint8_t
{
	EPartyInviteFilter__AllowAll   = 0,
	EPartyInviteFilter__FriendsOnly = 1,
	EPartyInviteFilter__BlockAll   = 2,
	EPartyInviteFilter__EPartyInviteFilter_MAX = 3
};


// Enum Archon.EArchonPathFollowingState
enum class EArchonPathFollowingState : uint8_t
{
	EArchonPathFollowingState__None = 0,
	EArchonPathFollowingState__FollowingArcingTurn = 1,
	EArchonPathFollowingState__FollowingFinalArcingTurn = 2,
	EArchonPathFollowingState__MovingToStartOfFinalArc = 3,
	EArchonPathFollowingState__MovingToFinalPivotPoint = 4,
	EArchonPathFollowingState__Pivoting = 5,
	EArchonPathFollowingState__FinalPivot = 6,
	EArchonPathFollowingState__FinalPivotComplete = 7,
	EArchonPathFollowingState__ResumingMove = 8,
	EArchonPathFollowingState__EArchonPathFollowingState_MAX = 9
};


// Enum Archon.EArchonParticleAttachType
enum class EArchonParticleAttachType : uint8_t
{
	EArchonParticleAttachType__Character = 0,
	EArchonParticleAttachType__Weapon = 1,
	EArchonParticleAttachType__EArchonParticleAttachType_MAX = 2
};


// Enum Archon.EArchonWarpComponentAutoRotationRateMode
enum class EArchonWarpComponentAutoRotationRateMode : uint8_t
{
	EArchonWarpComponentAutoRotationRateMode__DEFAULT = 0,
	EArchonWarpComponentAutoRotationRateMode__AUTO_ROTATION_RATE = 1,
	EArchonWarpComponentAutoRotationRateMode__AUTO_ROTATION_RATE_FULL_DURATION = 2,
	EArchonWarpComponentAutoRotationRateMode__EArchonWarpComponentAutoRotationRateMode_MAX = 3
};


// Enum Archon.EArchonWarpComponentUpdateType
enum class EArchonWarpComponentUpdateType : uint8_t
{
	EArchonWarpComponentUpdateType__DISABLED = 0,
	EArchonWarpComponentUpdateType__RUN_ON_SERVER_ONLY = 1,
	EArchonWarpComponentUpdateType__RUN_ON_CLIENT_ONLY = 2,
	EArchonWarpComponentUpdateType__RUN_ON_BOTH = 3,
	EArchonWarpComponentUpdateType__EArchonWarpComponentUpdateType_MAX = 4
};


// Enum Archon.EWeaponRole
enum class EWeaponRole : uint8_t
{
	EWeaponRole__WeaponRole_NONE   = 0,
	EWeaponRole__WeaponRole_PRIMARY = 1,
	EWeaponRole__WeaponRole_OFFHAND = 2,
	EWeaponRole__WeaponRole_MAX    = 3
};


// Enum Archon.EWeaponState
enum class EWeaponState : uint8_t
{
	EWeaponState__Equipped         = 0,
	EWeaponState__Unequipped       = 1,
	EWeaponState__Attacking        = 2,
	EWeaponState__EWeaponState_MAX = 3
};


// Enum Archon.EWeaponType
enum class EWeaponType : uint8_t
{
	EWeaponType__WeaponType_NONE   = 0,
	EWeaponType__WeaponType_IHAMMER = 1,
	EWeaponType__WeaponType_GAXE   = 2,
	EWeaponType__WeaponType_EBLADE = 3,
	EWeaponType__WeaponType_CBLADES = 4,
	EWeaponType__WeaponType_MSPEAR = 5,
	EWeaponType__WeaponType_MAX    = 6
};


// Enum Archon.ECellEffectType
enum class ECellEffectType : uint8_t
{
	ECellEffectType__Standard      = 0,
	ECellEffectType__Unique        = 1,
	ECellEffectType__ECellEffectType_MAX = 2
};


// Enum Archon.ECellType
enum class ECellType : uint8_t
{
	ECellType__None                = 0,
	ECellType__CellType_Generic    = 1,
	ECellType__CellType_Weapon_Generic = 2,
	ECellType__CellType_Weapon_Axe = 3,
	ECellType__CellType_Weapon_Sword = 4,
	ECellType__CellType_Weapon_Hammer = 5,
	ECellType__CellType_Weapon_CBlades = 6,
	ECellType__CellType_Weapon_Spear = 7,
	ECellType__CellType_Armour_Generic = 8,
	ECellType__CellType_Armour_Head = 9,
	ECellType__CellType_Armour_Chest = 10,
	ECellType__CellType_Armour_Arms = 11,
	ECellType__CellType_Armour_Legs = 12,
	ECellType__CellType_Lantern_Generic = 13,
	ECellType__CellType_Lantern_Ability = 14,
	ECellType__CellType_Defence    = 15,
	ECellType__CellType_Power      = 16,
	ECellType__CellType_Mobility   = 17,
	ECellType__CellType_Technique  = 18,
	ECellType__CellType_Utility    = 19,
	ECellType__Max                 = 20,
	ECellType__ECellType_MAX       = 21
};


// Enum Archon.EChallengeSlotDuration
enum class EChallengeSlotDuration : uint8_t
{
	EChallengeSlotDuration__Daily  = 0,
	EChallengeSlotDuration__Weekly = 1,
	EChallengeSlotDuration__EChallengeSlotDuration_MAX = 2
};


// Enum Archon.EComboBufferPriority
enum class EComboBufferPriority : uint8_t
{
	EComboBufferPriority__Exclusive = 0,
	EComboBufferPriority__FallThrough = 1,
	EComboBufferPriority__EComboBufferPriority_MAX = 2
};


// Enum Archon.EComboBufferMethod
enum class EComboBufferMethod : uint8_t
{
	EComboBufferMethod__Mixed      = 0,
	EComboBufferMethod__Buffered   = 1,
	EComboBufferMethod__Instant    = 2,
	EComboBufferMethod__MixedModifier = 3,
	EComboBufferMethod__EComboBufferMethod_MAX = 4
};


// Enum Archon.EArchonAttackActionContext
enum class EArchonAttackActionContext : uint8_t
{
	EArchonAttackActionContext__All = 0,
	EArchonAttackActionContext__Sprint = 1,
	EArchonAttackActionContext__Roll = 2,
	EArchonAttackActionContext__Block = 3,
	EArchonAttackActionContext__EArchonAttackActionContext_MAX = 4
};


// Enum Archon.EArchonAttackActionKeyModifier
enum class EArchonAttackActionKeyModifier : uint8_t
{
	EArchonAttackActionKeyModifier__None = 0,
	EArchonAttackActionKeyModifier__SpecialAction = 1,
	EArchonAttackActionKeyModifier__Sprint = 2,
	EArchonAttackActionKeyModifier__Roll = 3,
	EArchonAttackActionKeyModifier__Block = 4,
	EArchonAttackActionKeyModifier__Forward = 5,
	EArchonAttackActionKeyModifier__Backward = 6,
	EArchonAttackActionKeyModifier__SideLeft = 7,
	EArchonAttackActionKeyModifier__SideRight = 8,
	EArchonAttackActionKeyModifier__Locomotion = 9,
	EArchonAttackActionKeyModifier__Any = 10,
	EArchonAttackActionKeyModifier__EArchonAttackActionKeyModifier_MAX = 11
};


// Enum Archon.EArchonAttackActionKey
enum class EArchonAttackActionKey : uint8_t
{
	EArchonAttackActionKey__None   = 0,
	EArchonAttackActionKey__PrimaryAttack = 1,
	EArchonAttackActionKey__SecondaryAttack = 2,
	EArchonAttackActionKey__Roll   = 3,
	EArchonAttackActionKey__SpecialAction = 4,
	EArchonAttackActionKey__EArchonAttackActionKey_MAX = 5
};


// Enum Archon.EArchonCombatInputType
enum class EArchonCombatInputType : uint8_t
{
	EArchonCombatInputType__InputType_Pressed = 0,
	EArchonCombatInputType__InputType_Released = 1,
	EArchonCombatInputType__InputType_Held = 2,
	EArchonCombatInputType__InputType_Any = 3,
	EArchonCombatInputType__InputType_MAX = 4
};


// Enum Archon.EArchonCombatEndReason
enum class EArchonCombatEndReason : uint8_t
{
	EArchonCombatEndReason__None   = 0,
	EArchonCombatEndReason__EndReason_CancelWindow = 1,
	EArchonCombatEndReason__EndReason_NoMontage = 2,
	EArchonCombatEndReason__EndReason_MontageBlendOut = 3,
	EArchonCombatEndReason__EndReason_CancelWindowLocomotion = 4,
	EArchonCombatEndReason__EArchonCombatEndReason_MAX = 5
};


// Enum Archon.EHuntTypeRequirement
enum class EHuntTypeRequirement : uint8_t
{
	EHuntTypeRequirement__Player   = 0,
	EHuntTypeRequirement__Matchmaker = 1,
	EHuntTypeRequirement__EHuntTypeRequirement_MAX = 2
};


// Enum Archon.EItemDescriptionFormat
enum class EItemDescriptionFormat : uint8_t
{
	EItemDescriptionFormat__Gather = 0,
	EItemDescriptionFormat__Craft  = 1,
	EItemDescriptionFormat__Upgrade = 2,
	EItemDescriptionFormat__EItemDescriptionFormat_MAX = 3
};


// Enum Archon.EGameplayQuestStatusRequirement
enum class EGameplayQuestStatusRequirement : uint8_t
{
	EGameplayQuestStatusRequirement__Any = 0,
	EGameplayQuestStatusRequirement__All = 1,
	EGameplayQuestStatusRequirement__EGameplayQuestStatusRequirement_MAX = 2
};


// Enum Archon.EItemRequirement
enum class EItemRequirement : uint8_t
{
	EItemRequirement__Any          = 0,
	EItemRequirement__All          = 1,
	EItemRequirement__None         = 2,
	EItemRequirement__EItemRequirement_MAX = 3
};


// Enum Archon.EArchonGuildRank
enum class EArchonGuildRank : uint8_t
{
	EArchonGuildRank__Invalid      = 0,
	EArchonGuildRank__Member       = 1,
	EArchonGuildRank__Officer      = 2,
	EArchonGuildRank__Leader       = 3,
	EArchonGuildRank__EArchonGuildRank_MAX = 4
};


// Enum Archon.EVictimRelativeHitDirection
enum class EVictimRelativeHitDirection : uint8_t
{
	EVictimRelativeHitDirection__ANY = 0,
	EVictimRelativeHitDirection__FRONT = 1,
	EVictimRelativeHitDirection__LEFT = 2,
	EVictimRelativeHitDirection__RIGHT = 3,
	EVictimRelativeHitDirection__BACK = 4,
	EVictimRelativeHitDirection__EVictimRelativeHitDirection_MAX = 5
};


// Enum Archon.EGatherableRarity
enum class EGatherableRarity : uint8_t
{
	EGatherableRarity__Common      = 0,
	EGatherableRarity__Rare        = 1,
	EGatherableRarity__EGatherableRarity_MAX = 2
};


// Enum Archon.EGatherableCategory
enum class EGatherableCategory : uint8_t
{
	EGatherableCategory__SpecialEvent_01 = 0,
	EGatherableCategory__SpecialEvent_02 = 1,
	EGatherableCategory__SpecialEvent_03 = 2,
	EGatherableCategory__SpecialEvent_04 = 3,
	EGatherableCategory__SpecialEvent_05 = 4,
	EGatherableCategory__SpecialEvent_06 = 5,
	EGatherableCategory__BehemothSign_01 = 6,
	EGatherableCategory__CrateCommon_01 = 7,
	EGatherableCategory__CrateEvent_01 = 8,
	EGatherableCategory__Debris_01 = 9,
	EGatherableCategory__Debris_02 = 10,
	EGatherableCategory__Debris_03 = 11,
	EGatherableCategory__Hoofed_Universal_01 = 12,
	EGatherableCategory__Wisp_Universal_01 = 13,
	EGatherableCategory__Wisp_Universal_02 = 14,
	EGatherableCategory__Wisp_Universal_03 = 15,
	EGatherableCategory__Wisp_Universal_04 = 16,
	EGatherableCategory__Wisp_Universal_05 = 17,
	EGatherableCategory__Wisp_Universal_06 = 18,
	EGatherableCategory__Wisp_Universal_07 = 19,
	EGatherableCategory__Wisp_Universal_08 = 20,
	EGatherableCategory__Wisp_Universal_09 = 21,
	EGatherableCategory__Wisp_Universal = 22,
	EGatherableCategory__Fauna     = 23,
	EGatherableCategory__Common_01 = 24,
	EGatherableCategory__Speed_01  = 25,
	EGatherableCategory__Damage_01 = 26,
	EGatherableCategory__Defense_01 = 27,
	EGatherableCategory__Healing_01 = 28,
	EGatherableCategory__Pylon_01  = 29,
	EGatherableCategory__Weapon_01 = 30,
	EGatherableCategory__Special_01 = 31,
	EGatherableCategory__EGatherableCategory_MAX = 32
};


// Enum Archon.ENavAreaFlag
enum class ENavAreaFlag : uint8_t
{
	ENavAreaFlag__Default          = 0,
	ENavAreaFlag__Jump             = 1,
	ENavAreaFlag__Crouch           = 2,
	ENavAreaFlag__ENavAreaFlag_MAX = 3
};


// Enum Archon.EObjectiveParentType
enum class EObjectiveParentType : uint8_t
{
	EObjectiveParentType__Unknown  = 0,
	EObjectiveParentType__ParentIsQuest = 1,
	EObjectiveParentType__ParentIsObjective = 2,
	EObjectiveParentType__ParentIsChallenge = 3,
	EObjectiveParentType__EObjectiveParentType_MAX = 4
};


// Enum Archon.EObjectiveStatus
enum class EObjectiveStatus : uint8_t
{
	EObjectiveStatus__NotStarted   = 0,
	EObjectiveStatus__InProgress   = 1,
	EObjectiveStatus__Completed    = 2,
	EObjectiveStatus__EObjectiveStatus_MAX = 3
};


// Enum Archon.ECollectItemDescriptionFormat
enum class ECollectItemDescriptionFormat : uint8_t
{
	ECollectItemDescriptionFormat__Gather = 0,
	ECollectItemDescriptionFormat__Craft = 1,
	ECollectItemDescriptionFormat__Upgrade = 2,
	ECollectItemDescriptionFormat__ECollectItemDescriptionFormat_MAX = 3
};


// Enum Archon.ECollectItemRequirement
enum class ECollectItemRequirement : uint8_t
{
	ECollectItemRequirement__PossessAndCollect = 0,
	ECollectItemRequirement__CollectOnly = 1,
	ECollectItemRequirement__ECollectItemRequirement_MAX = 2
};


// Enum Archon.EEconomyTransactionType
enum class EEconomyTransactionType : uint8_t
{
	EEconomyTransactionType__Invalid = 0,
	EEconomyTransactionType__Granted = 1,
	EEconomyTransactionType__Consumed = 2,
	EEconomyTransactionType__SetUses = 3,
	EEconomyTransactionType__Delta = 4,
	EEconomyTransactionType__EEconomyTransactionType_MAX = 5
};


// Enum Archon.EOnlineRegion
enum class EOnlineRegion : uint8_t
{
	EOnlineRegion__US              = 0,
	EOnlineRegion__EU              = 1,
	EOnlineRegion__AUS             = 2,
	EOnlineRegion__EOnlineRegion_MAX = 3
};


// Enum Archon.EEmoteType
enum class EEmoteType : uint8_t
{
	EEmoteType__PlayerActivated    = 0,
	EEmoteType__IslandIntro        = 1,
	EEmoteType__MasterOfTheHunt    = 2,
	EEmoteType__EEmoteType_MAX     = 3
};


// Enum Archon.EItemGroupType
enum class EItemGroupType : uint8_t
{
	EItemGroupType__None           = 0,
	EItemGroupType__Armour_Chest   = 1,
	EItemGroupType__Armour_Helm    = 2,
	EItemGroupType__Armour_Legs    = 3,
	EItemGroupType__Armour_Arms    = 4,
	EItemGroupType__Armour_Lantern = 5,
	EItemGroupType__Weapon_Sword   = 6,
	EItemGroupType__Weapon_Axe     = 7,
	EItemGroupType__Weapon_Hammer  = 8,
	EItemGroupType__Weapon_ChainBlades = 9,
	EItemGroupType__Weapon_Spear   = 10,
	EItemGroupType__QuickItem_Healing = 11,
	EItemGroupType__QuickItem_Defense = 12,
	EItemGroupType__QuickItem_Offense = 13,
	EItemGroupType__QuickItem_Flare = 14,
	EItemGroupType__QuickItem_Supplies = 15,
	EItemGroupType__Banner_Mesh    = 16,
	EItemGroupType__Banner_Fabric  = 17,
	EItemGroupType__Banner_Sigil   = 18,
	EItemGroupType__Banner_VFX     = 19,
	EItemGroupType__Banner_Animation = 20,
	EItemGroupType__Recipe         = 21,
	EItemGroupType__Dye            = 22,
	EItemGroupType__Token          = 23,
	EItemGroupType__Core           = 24,
	EItemGroupType__Emote          = 25,
	EItemGroupType__Currency       = 26,
	EItemGroupType__QuestItem      = 27,
	EItemGroupType__Reagent        = 28,
	EItemGroupType__Breakpart      = 29,
	EItemGroupType__Title          = 30,
	EItemGroupType__Cell           = 31,
	EItemGroupType__QuickItem_Generic = 32,
	EItemGroupType__QuickItem_FlaskTransient = 33,
	EItemGroupType__Max            = 34,
	EItemGroupType__EItemGroupType_MAX = 35
};


// Enum Archon.EItemRarityLevelType
enum class EItemRarityLevelType : uint8_t
{
	EItemRarityLevelType__Poor     = 0,
	EItemRarityLevelType__Common   = 1,
	EItemRarityLevelType__Uncommon = 2,
	EItemRarityLevelType__Rare     = 3,
	EItemRarityLevelType__Epic     = 4,
	EItemRarityLevelType__Legendary = 5,
	EItemRarityLevelType__Artifact = 6,
	EItemRarityLevelType__EItemRarityLevelType_MAX = 7
};


// Enum Archon.EPlayFabCatalogCurrency
enum class EPlayFabCatalogCurrency : uint8_t
{
	EPlayFabCatalogCurrency__VC    = 0,
	EPlayFabCatalogCurrency__RM    = 1,
	EPlayFabCatalogCurrency__EPlayFabCatalogCurrency_MAX = 2
};


// Enum Archon.EQuestRedeemRestriction
enum class EQuestRedeemRestriction : uint8_t
{
	EQuestRedeemRestriction__CityOnly = 0,
	EQuestRedeemRestriction__DuringHunt = 1,
	EQuestRedeemRestriction__EQuestRedeemRestriction_MAX = 2
};


// Enum Archon.EQuestEventTrigger
enum class EQuestEventTrigger : uint8_t
{
	EQuestEventTrigger__Intro      = 0,
	EQuestEventTrigger__Accept     = 1,
	EQuestEventTrigger__Redeem     = 2,
	EQuestEventTrigger__Outro      = 3,
	EQuestEventTrigger__GameplayStart = 4,
	EQuestEventTrigger__EQuestEventTrigger_MAX = 5
};


// Enum Archon.EScheduleType
enum class EScheduleType : uint8_t
{
	EScheduleType__NotScheduled    = 0,
	EScheduleType__OneTimeOnly     = 1,
	EScheduleType__Daily           = 2,
	EScheduleType__Weekly          = 3,
	EScheduleType__EScheduleType_MAX = 4
};


// Enum Archon.ESerieStatus
enum class ESerieStatus : uint8_t
{
	ESerieStatus__NotAvailable     = 0,
	ESerieStatus__InProgress       = 1,
	ESerieStatus__Completed        = 2,
	ESerieStatus__ESerieStatus_MAX = 3
};


// Enum Archon.EArchonStaggerTurnBehaviourKey
enum class EArchonStaggerTurnBehaviourKey : uint8_t
{
	EArchonStaggerTurnBehaviourKey__None = 0,
	EArchonStaggerTurnBehaviourKey__TurnToFace = 1,
	EArchonStaggerTurnBehaviourKey__TurnToFaceAway = 2,
	EArchonStaggerTurnBehaviourKey__EArchonStaggerTurnBehaviourKey_MAX = 3
};


// Enum Archon.ECraftItemsRequirement
enum class ECraftItemsRequirement : uint8_t
{
	ECraftItemsRequirement__CraftAny = 0,
	ECraftItemsRequirement__CraftAll = 1,
	ECraftItemsRequirement__CraftNone = 2,
	ECraftItemsRequirement__ECraftItemsRequirement_MAX = 3
};


// Enum Archon.EQuestCompleteRequirement
enum class EQuestCompleteRequirement : uint8_t
{
	EQuestCompleteRequirement__All = 0,
	EQuestCompleteRequirement__Any = 1,
	EQuestCompleteRequirement__EQuestCompleteRequirement_MAX = 2
};


// Enum Archon.ERequiredQuestState
enum class ERequiredQuestState : uint8_t
{
	ERequiredQuestState__Redeemed  = 0,
	ERequiredQuestState__Redeemable = 1,
	ERequiredQuestState__ERequiredQuestState_MAX = 2
};


// Enum Archon.EQuestStatusRequirement
enum class EQuestStatusRequirement : uint8_t
{
	EQuestStatusRequirement__All   = 0,
	EQuestStatusRequirement__Any   = 1,
	EQuestStatusRequirement__EQuestStatusRequirement_MAX = 2
};


// Enum Archon.ERecipeCustomComponent
enum class ERecipeCustomComponent : uint8_t
{
	ERecipeCustomComponent__RecipeComponent_00 = 0,
	ERecipeCustomComponent__RecipeComponent_01 = 1,
	ERecipeCustomComponent__RecipeComponent_02 = 2,
	ERecipeCustomComponent__RecipeComponent_03 = 3,
	ERecipeCustomComponent__RecipeComponent_04 = 4,
	ERecipeCustomComponent__RecipeComponent_05 = 5,
	ERecipeCustomComponent__RecipeComponent_06 = 6,
	ERecipeCustomComponent__RecipeComponent_07 = 7,
	ERecipeCustomComponent__RecipeComponent_08 = 8,
	ERecipeCustomComponent__RecipeComponent_09 = 9,
	ERecipeCustomComponent__RecipeComponent = 10,
	ERecipeCustomComponent__RecipeComponent01 = 11,
	ERecipeCustomComponent__RecipeComponent02 = 12,
	ERecipeCustomComponent__RecipeComponent03 = 13,
	ERecipeCustomComponent__RecipeComponent04 = 14,
	ERecipeCustomComponent__RecipeComponent05 = 15,
	ERecipeCustomComponent__RecipeComponent06 = 16,
	ERecipeCustomComponent__RecipeComponent07 = 17,
	ERecipeCustomComponent__RecipeComponent08 = 18,
	ERecipeCustomComponent__RecipeComponent09 = 19,
	ERecipeCustomComponent__RecipeComponent10 = 20,
	ERecipeCustomComponent__RecipeComponent_MAX = 21
};


// Enum Archon.EUpgradeableItemLevel
enum class EUpgradeableItemLevel : uint8_t
{
	EUpgradeableItemLevel__Level_00 = 0,
	EUpgradeableItemLevel__Level_01 = 1,
	EUpgradeableItemLevel__Level_02 = 2,
	EUpgradeableItemLevel__Level_03 = 3,
	EUpgradeableItemLevel__Level_04 = 4,
	EUpgradeableItemLevel__Level_05 = 5,
	EUpgradeableItemLevel__Level_06 = 6,
	EUpgradeableItemLevel__Level_07 = 7,
	EUpgradeableItemLevel__Level_08 = 8,
	EUpgradeableItemLevel__Level_09 = 9,
	EUpgradeableItemLevel__Level   = 10,
	EUpgradeableItemLevel__Level01 = 11,
	EUpgradeableItemLevel__Level02 = 12,
	EUpgradeableItemLevel__Level03 = 13,
	EUpgradeableItemLevel__Level04 = 14,
	EUpgradeableItemLevel__Level05 = 15,
	EUpgradeableItemLevel__Level06 = 16,
	EUpgradeableItemLevel__Level07 = 17,
	EUpgradeableItemLevel__Level08 = 18,
	EUpgradeableItemLevel__Level09 = 19,
	EUpgradeableItemLevel__Level10 = 20,
	EUpgradeableItemLevel__EUpgradeableItemLevel_MAX = 21
};


// Enum Archon.EArchonBuildType
enum class EArchonBuildType : uint8_t
{
	EArchonBuildType__Unknown      = 0,
	EArchonBuildType__Debug        = 1,
	EArchonBuildType__DebugGame    = 2,
	EArchonBuildType__Development  = 3,
	EArchonBuildType__Shipping     = 4,
	EArchonBuildType__Test         = 5,
	EArchonBuildType__EArchonBuildType_MAX = 6
};


// Enum Archon.EArchonCaseBehaviour
enum class EArchonCaseBehaviour : uint8_t
{
	EArchonCaseBehaviour__NoConversion = 0,
	EArchonCaseBehaviour__LowerCase = 1,
	EArchonCaseBehaviour__UpperCase = 2,
	EArchonCaseBehaviour__EArchonCaseBehaviour_MAX = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Archon.ArchonAbilityDamageValues
// 0x001C
struct FArchonAbilityDamageValues
{
	float                                              PhysicalDamage;                                           // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FlameDamage;                                              // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              FrostDamage;                                              // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ShockDamage;                                              // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RadiantDamage;                                            // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              UmbralDamage;                                             // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              RawElementalDamage;                                       // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Archon.ArchonAbilityDamageInfo
// 0x00E0
struct FArchonAbilityDamageInfo
{
	struct FGameplayEventData                          Payload;                                                  // 0x0000(0x00A8) (Edit, BlueprintVisible, BlueprintReadOnly)
	float                                              BaseDamage;                                               // 0x00A8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EElementType                                       DamageElement;                                            // 0x00AC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x00AD(0x0003) MISSED OFFSET
	float                                              RawDamage;                                                // 0x00B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FArchonAbilityDamageValues                  MitigatedDamage;                                          // 0x00B4(0x001C) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	float                                              TotalElementalDamage;                                     // 0x00D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TotalPhysicalDamage;                                      // 0x00D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TotalDamageApplied;                                       // 0x00D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET
};

// ScriptStruct Archon.ArchonExtendedDamageInfo
// 0x0020
struct FArchonExtendedDamageInfo
{
	struct FGuid                                       AttackID;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, IsPlainOldData)
	TArray<struct FGameplayTag>                        Tags;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Archon.ArchonMeshMorphValue
// 0x0020
struct FArchonMeshMorphValue
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	class FString                                      MorphName;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              Value;                                                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct Archon.ArchonMeshAppearanceData
// 0x0028
struct FArchonMeshAppearanceData
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	class FString                                      SkeletalMeshComponentName;                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FArchonMeshMorphValue>               MorphData;                                                // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Archon.AppearanceAssetReference
// 0x0030
struct FAppearanceAssetReference
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FName                                       Key;                                                      // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TAssetPtr<class UObject>                           Asset;                                                    // 0x0010(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct Archon.AppearanceStringData
// 0x0020
struct FAppearanceStringData
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FName                                       Key;                                                      // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class FString                                      Data;                                                     // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Archon.ArchonAppearanceData
// 0x0040
struct FArchonAppearanceData
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	EArchonCharacterCreationState                      CreationState;                                            // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
	TArray<struct FArchonMeshAppearanceData>           MeshData;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAppearanceAssetReference>           AssetReferences;                                          // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FAppearanceStringData>               StringData;                                               // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Archon.ArmourSetKeyword
// 0x0018
struct FArmourSetKeyword
{
	int                                                AddedCount;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FDataTableRowHandle                         ArmorSet;                                                 // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
};

// ScriptStruct Archon.ArmourSetItemResistanceTableData
// 0x0010 (0x0018 - 0x0008)
struct FArmourSetItemResistanceTableData : public FTableRowBase
{
	TArray<class UClass*>                              Abilities;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
};

// ScriptStruct Archon.DyeVariant
// 0x0010
struct FDyeVariant
{
	struct FName                                       PrimaryDyeRowName;                                        // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       SecondaryDyeRowName;                                      // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Archon.ArmourResistanceTableData
// 0x0060 (0x0078 - 0x0018)
struct FArmourResistanceTableData : public FArmourSetItemResistanceTableData
{
	float                                              GlobalResistance;                                         // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              GlobalResistancePerLevel;                                 // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlameResistance;                                          // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlameResistancePerLevel;                                  // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FrostResistance;                                          // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FrostResistancePerLevel;                                  // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShockResistance;                                          // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShockResistancePerLevel;                                  // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiantResistance;                                        // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiantResistancePerLevel;                                // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UmbralResistance;                                         // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UmbralResistancePerLevel;                                 // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FGameplayTag>                        GrantedTags;                                              // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FGameplayTag>                        AssetTags;                                                // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FArmourSetKeyword>                   ArmorSetKeywords;                                         // 0x0068(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Archon.ArchonAttributeModifier
// 0x0010
struct FArchonAttributeModifier
{
	struct FName                                       SourceName;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EArchonAttributeModifierType                       ModifierType;                                             // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	float                                              Modifier;                                                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Archon.ArchonAttribute
// 0x0028
struct FArchonAttribute
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BaseValue;                                                // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
	TArray<struct FArchonAttributeModifier>            Modifiers;                                                // 0x0010(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0020(0x0008) MISSED OFFSET
};

// ScriptStruct Archon.BannerCustomizationItemIDs
// 0x0080
struct FBannerCustomizationItemIDs
{
	class FString                                      BannerMeshItemID;                                         // 0x0000(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      FabricMaterialItemID;                                     // 0x0010(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      SigilTextureItemID;                                       // 0x0020(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      VFXItemID;                                                // 0x0030(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      AnimationItemID;                                          // 0x0040(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      BackgroundColourItemID;                                   // 0x0050(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      BorderColourItemID;                                       // 0x0060(0x0010) (BlueprintVisible, ZeroConstructor)
	class FString                                      SigilColourItemID;                                        // 0x0070(0x0010) (BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Archon.DamageEventData
// 0x0058
struct FDamageEventData
{
	TArray<float>                                      PreMitigationDamages;                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      Multipliers;                                              // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      ResistanceDeltas;                                         // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      PostResistDamages;                                        // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              ExplicitPartBreakDamage;                                  // 0x0040(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExplicitStaggerDamage;                                    // 0x0044(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ExplicitExposeDamage;                                     // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FinalStaggerDamage;                                       // 0x004C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FinalExposeDamage;                                        // 0x0050(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct Archon.DamageTableData
// 0x0058 (0x0060 - 0x0008)
struct FDamageTableData : public FTableRowBase
{
	int                                                BaseDamage;                                               // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EPhysicalType                                      PhysicalTypeOverride;                                     // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x000D(0x0003) MISSED OFFSET
	int                                                ExplicitPartBreak;                                        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ExplicitStagger;                                          // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ExplicitExpose;                                           // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DamageTrue;                                               // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                PhysicalDamage;                                           // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FlameDamage;                                              // 0x0024(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                FrostDamage;                                              // 0x0028(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ShockDamage;                                              // 0x002C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RadiantDamage;                                            // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                UmbralDamage;                                             // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                RawElementalDamage;                                       // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Meter;                                                    // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      DamageTypeClass;                                          // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      Effect;                                                   // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<struct FGameplayTag>                        AssetTags;                                                // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct Archon.NameValuePair
// 0x0010
struct FNameValuePair
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Value;                                                    // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x000C(0x0004) MISSED OFFSET
};

// ScriptStruct Archon.EffectDef
// 0x0018
struct FEffectDef
{
	class UClass*                                      Effect;                                                   // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TArray<struct FNameValuePair>                      Overrides;                                                // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
};

// ScriptStruct Archon.PlayFabCatalogCurrency
// 0x0008
struct FPlayFabCatalogCurrency
{
	EPlayFabCatalogCurrency                            CurrencyType;                                             // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Amount;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Archon.CatalogItemGenericCustomData
// 0x0048
struct FCatalogItemGenericCustomData
{
	int                                                TierLevel;                                                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EItemRarityLevelType                               RarityLevel;                                              // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EItemGroupType                                     Kind;                                                     // 0x0005(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0006(0x0002) MISSED OFFSET
	class FString                                      DustItemResult;                                           // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FName>                               SetInformation;                                           // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TAssetPtr<class UTexture2D>                        Icon;                                                     // 0x0028(0x0020) (Edit, BlueprintVisible)
};

// ScriptStruct Archon.PlayFabCatalogItemQuantity
// 0x0018
struct FPlayFabCatalogItemQuantity
{
	class FString                                      Item;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                Amount;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct Archon.ArchonCatalogItem
// 0x0270
struct FArchonCatalogItem
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	class FString                                      ItemID;                                                   // 0x0008(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FStringClassReference                       ItemClass;                                                // 0x0018(0x0010) (BlueprintVisible, BlueprintReadOnly)
	class FString                                      CatalogVersion;                                           // 0x0028(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class UDataTable*                                  Catalog;                                                  // 0x0038(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class FString                                      DisplayNameInvariant;                                     // 0x0040(0x0010) (ZeroConstructor, Transient)
	class FString                                      DescriptionInvariant;                                     // 0x0050(0x0010) (ZeroConstructor, Transient)
	struct FText                                       DisplayName;                                              // 0x0060(0x0018) (BlueprintVisible, BlueprintReadOnly)
	struct FText                                       Description;                                              // 0x0078(0x0018) (BlueprintVisible, BlueprintReadOnly)
	TArray<class FString>                              Tags;                                                     // 0x0090(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	class FString                                      CustomData;                                               // 0x00A0(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	bool                                               IsStackable;                                              // 0x00B0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsBundle;                                                 // 0x00B1(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsContainer;                                              // 0x00B2(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x00B3(0x0005) MISSED OFFSET
	TArray<class FString>                              ContainerItemContents;                                    // 0x00B8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class FString>                              ContainerResultTableContents;                             // 0x00C8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class FString>                              BundledItems;                                             // 0x00D8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<class FString>                              BundledResultTables;                                      // 0x00E8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FPlayFabCatalogCurrency>             VirtualCurrencyPrices;                                    // 0x00F8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FPlayFabCatalogCurrency>             RealCurrencyPrices;                                       // 0x0108(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FCatalogItemGenericCustomData               ItemData;                                                 // 0x0118(0x0048) (BlueprintVisible, BlueprintReadOnly)
	TArray<struct FPlayFabCatalogItemQuantity>         ContainerItemContentsWithQuantity;                        // 0x0160(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FPlayFabCatalogItemQuantity>         ContainerResultTableContentsWithQuantity;                 // 0x0170(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FPlayFabCatalogItemQuantity>         BundledItemsWithQuantity;                                 // 0x0180(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FPlayFabCatalogItemQuantity>         BundledResultTablesWithQuantity;                          // 0x0190(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData02[0xA0];                                      // 0x01A0(0x00A0) MISSED OFFSET
	int                                                MaxQuantity;                                              // 0x0240(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0244(0x0004) MISSED OFFSET
	TArray<struct FPlayFabCatalogItemQuantity>         OtherItemQuantities;                                      // 0x0248(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TArray<struct FPlayFabCatalogItemQuantity>         AlternateItemsToGrant;                                    // 0x0258(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                GuaranteedItemsFromContainer;                             // 0x0268(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x026C(0x0004) MISSED OFFSET
};

// ScriptStruct Archon.CatalogItemRewardInfo
// 0x0050
struct FCatalogItemRewardInfo
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly)
	struct FText                                       Description;                                              // 0x0018(0x0018) (BlueprintVisible, BlueprintReadOnly)
	TAssetPtr<class UTexture2D>                        Icon;                                                     // 0x0030(0x0020) (BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Archon.AppliedCellEffectCounter
// 0x0020
struct FAppliedCellEffectCounter
{
	struct FDataTableRowHandle                         CellEffect;                                               // 0x0000(0x0010) (BlueprintVisible)
	struct FName                                       CellEffectID;                                             // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Magnitude;                                                // 0x0018(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Rank;                                                     // 0x001C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct Archon.HitInfo
// 0x0040
struct FHitInfo
{
	float                                              Damage;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	class UDamageType*                                 DamageType;                                               // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AController*                                 InstigatedBy;                                             // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AActor*                                      DamageCauser;                                             // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FArchonExtendedDamageInfo                   ExtendedDamageInfo;                                       // 0x0020(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct Archon.ReplicatedArchonTraversalInfo
// 0x0018
