#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct CC_MakeupSkinSettings_Type.CC_MakeupSkinSettings_Type
// 0x0014
struct FCC_MakeupSkinSettings_Type
{
	float                                              MakeupToggle_34_3EB523FD455003989C566BB5DFC9004B;         // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Desaturate_35_144DFA8B45BC9F7834CCD2864445C0C5;           // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Brightness_38_7E3F855040162297A788CBBD127E95FE;           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Contrast_40_6003806F404903CF3AEAA480BFBEB804;             // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FoundationIntensity_42_8AF3D225440391DB097F4981C9EB3E5F;  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
