#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Menu_CharacterStageRoot_bpw_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// WidgetBlueprintGeneratedClass Menu_CharacterStageRoot_bpw.Menu_CharacterStageRoot_bpw_C
// 0x018C (0x047C - 0x02F0)
class UMenu_CharacterStageRoot_bpw_C : public UArchonUserWidget
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x02F0(0x0008) (Transient, DuplicateTransient)
	class Uw_FullscreenContainer_C*                    CharStage_WFullscreenFG;                                  // 0x02F8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uinventory_screen_bpw_C*                     inventory_screen_bpw;                                     // 0x0300(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Ujournal_screen_bpw_C*                       Journal;                                                  // 0x0308(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uloadout_screen_bpw_C*                       LOADOUT;                                                  // 0x0310(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_PlayerNameandTitle_MenuDisplay_bpw_C*     PlayerTitleDisplay;                                       // 0x0318(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Ustyle_screen_bpw_C*                         Style;                                                    // 0x0320(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UTextBlock*                                  TextBlock_5;                                              // 0x0328(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UTextBlock*                                  TextBlock_6;                                              // 0x0330(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_button_legend_C*                          w_button_legend;                                          // 0x0338(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_tabs_scaleable_bpw_C*                     w_tabs_scaleable_bpw_463;                                 // 0x0340(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UWidgetSwitcher*                             WidgetSwitcher_1;                                         // 0x0348(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class AUI_paperdoll_bp_C*                          PaperDoll_BP;                                             // 0x0350(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class Abanner_base_bp_C*                           Banner;                                                   // 0x0358(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class AActor*                                      Player_Pawn_View_Target;                                  // 0x0360(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)
	class UMaterialInstanceDynamic*                    DynamicBannerMaterial;                                    // 0x0368(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TAssetPtr<class USkeletalMesh>                     OG_Standard;                                              // 0x0370(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	TAssetPtr<class UMaterialInstance>                 OG_FabricMaterial;                                        // 0x0390(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	TAssetPtr<class UTexture>                          OG_SigilPattern;                                          // 0x03B0(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                             VFXReference;                                             // 0x03D0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TAssetPtr<class UParticleSystem>                   OG_VFX;                                                   // 0x03D8(0x0020) (Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                      OG_SigilColourRowName;                                    // 0x03F8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                      OG_BorderColourRowName;                                   // 0x0408(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                      OG_BackgroundColourRowName;                               // 0x0418(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FScriptMulticastDelegate                    CloseVanity;                                              // 0x0428(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	TEnumAsByte<EScreenMode_VanityMenu>                VanityScreenMode;                                         // 0x0438(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               OpenedByHotkey_;                                          // 0x0439(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x043A(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    UpdatePlayerTitle;                                        // 0x0440(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	TEnumAsByte<Eui_character_screen_mode>             CharacterStageMode;                                       // 0x0450(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<Eui_character_screen_mode>             PrevCharacterStageMode;                                   // 0x0451(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0452(0x0006) MISSED OFFSET
	struct FScriptMulticastDelegate                    CloseCharacterStage;                                      // 0x0458(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	bool                                               OpenedFromLobby;                                          // 0x0468(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               BlockInput;                                               // 0x0469(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x046A(0x0006) MISSED OFFSET
	class Upaperdoll_scene_component_C*                PaperdollScene;                                           // 0x0470(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                CurrentTab;                                               // 0x0478(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("WidgetBlueprintGeneratedClass Menu_CharacterStageRoot_bpw.Menu_CharacterStageRoot_bpw_C");
		return ptr;
	}


	ESlateVisibility GetVisibility_2();
	void ClearXButton();
	void SetupLoadoutButtons();
	ESlateVisibility Get_PlayerTitleDisplay_Visibility_1();
	class UWidget* GetDefaultFocusedWidget();
	struct FText Get_TextBlock_5_Text_1();
	struct FText Get_TextBlock_4_Text_1();
	void SetTabActive(int ActiveIndex);
	bool GetbIsEnabled_1();
	ESlateVisibility GetVisibility_1();
	struct FEventReply OnKeyDown(struct FGeometry* MyGeometry, struct FKeyEvent* InKeyEvent);
	void SetSurfaceType_Border(EArmourDyeSurfaceType NewParam, class UMaterialInstanceDynamic* InputPin);
	void SetSurfaceType_Sigil(EArmourDyeSurfaceType Selection, class UMaterialInstanceDynamic* InputPin);
	void SetSurfaceType_Fabric(class UMaterialInstanceDynamic* InputPin, EArmourDyeSurfaceType Selection);
	void OnLoaded_259E93B346D8320710C05098D8D60610(class UObject* Loaded);
	void OnLoaded_3F35769B498AD9949AFC33A287C5999D(class UObject* Loaded);
	void OnLoaded_EF8C34C04D8998C189D9ED81EF0EE489(class UObject* Loaded);
	void OnLoaded_C57B38554EE57C0C373A2CADF6A20D59(class UObject* Loaded);
	void OnLoaded_A20BF3C8473CD99F10B61E9F2E4541D2(class UObject* Loaded);
	void OnLoaded_6787120A47241D43C1981CAF00D4E53E(class UObject* Loaded);
	void OnLoaded_136728504E8081B37AB3D9B108DD3805(class UObject* Loaded);
	void OnLoaded_6B5CBDD640062417C1EA4EBE8CBF7DBE(class UObject* Loaded);
	void OnLoaded_B508F5064F1CF6A4C95DF3A4D45ED078(class UObject* Loaded);
	void OnLoaded_1ACC5F764F22046FC9D880AE01E29B73(class UObject* Loaded);
	void OnLoaded_107560E2480A39C090A4AC9029FD581B(class UObject* Loaded);
	void OnLoaded_1F879AD345AF4F7DEA6BD0A6C99987AD(class UObject* Loaded);
	void OnLoaded_9053DCC44E0A1C3E50EDFE92EAA99790(class UObject* Loaded);
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_198_Paperdoll_PlayEmote__DelegateSignature(const class FString& emoteID);
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_220_Paperdoll_ResetEmote__DelegateSignature();
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_282_Paperdoll_PlayArrival__DelegateSignature(const class FString& ArrivalID);
	void SetBannerMaterial();
	void SpawnBanner();
	void RefreshBanner();
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_148_Paperdoll_UpdateDye__DelegateSignature(const struct FName& RowName, int ActiveDyeSlot);
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_174_Paperdoll_UpdateBanner__DelegateSignature(const struct FBannerCustomizationItemIDs& Banner_IDs);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_3_LoadoutCategorySelected_L_Weapons__DelegateSignature(EWeaponType NewParam);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_4_LoadoutCategorySelected_R_Armour__DelegateSignature(TEnumAsByte<Earmor_slot_enum> NewParam);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_9_UpdatePaperdoll_EquipNewItem__DelegateSignature(const class FString& ItemID, EItemGroupType Type, const class FString& InstanceId);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_10_RefreshPaperdoll_Pose__DelegateSignature(EWeaponType NewParam);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_11_UpdatePaperdoll_ArmourTint__DelegateSignature(const struct FDyeVariant& NewParam, EArmorType NewParam1);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_366_LoadoutCategoryHovered__DelegateSignature(TEnumAsByte<ELoadout_ScreenMode> Category);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_807_BackToMainStage_From__DelegateSignature(TEnumAsByte<ELoadout_ScreenMode> ScreenMode);
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_880_LoadoutCategorySelected_Consumables__DelegateSignature();
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_1_UpdatePaperdoll_Transmog__DelegateSignature(const class FString& InstanceId, const class FString& TransmogId);
	void BndEvt__Style_K2Node_ComponentBoundEvent_50_UpdatePlayerTitleOnOtherMenus__DelegateSignature(const class FString& PlayerTItle);
	void Construct();
	void OpenLoadout();
	void Open_Style();
	void BndEvt__Menu_VanityLoadout_bpw_K2Node_ComponentBoundEvent_238_ExitVanityMenu__DelegateSignature();
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_202_ScreenModeChange__DelegateSignature(TEnumAsByte<EScreenMode_VanityMenu> Mode);
	void BndEvt__Vanity_K2Node_ComponentBoundEvent_320_Paperdoll_BannerEmote__DelegateSignature(const class FString& BannerEmote);
	void BndEvt__w_tabs_scaleable_bpw_462_K2Node_ComponentBoundEvent_398_TabSelected__DelegateSignature(int NewMode);
	void OpenJournal();
	void GTFO_CharacterStage();
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_346_BlockParentInput__DelegateSignature(bool BlockInput);
	void Cleanup_Stage();
	void BndEvt__Loadout_K2Node_ComponentBoundEvent_1059_ExitLoadout__DelegateSignature();
	void BndEvt__Journal_K2Node_ComponentBoundEvent_688_JournalClosed__DelegateSignature();
	void OpenInventory();
	void BndEvt__inventory_screen_bpw_K2Node_ComponentBoundEvent_178_OnInventoryClosed__DelegateSignature(TEnumAsByte<Eui_character_screen_mode> Previous_Screen);
	void ExecuteUbergraph_Menu_CharacterStageRoot_bpw(int EntryPoint);
	void CloseCharacterStage__DelegateSignature(TEnumAsByte<Eui_character_screen_mode> Previous_Screen);
	void UpdatePlayerTitle__DelegateSignature(const struct FText& PlayerTItle);
	void CloseVanity__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
