#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_P_male_postprocessing_animbp_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass P_male_postprocessing_animbp.P_male_postprocessing_animbp_C
// 0xE668 (0xE9F0 - 0x0388)
class UP_male_postprocessing_animbp_C : public UAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0388(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_0BDBFA2849868DF53DB2518174CD4C79;// 0x0390(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_DC1D6E84429A24E4F81C51982DC36757;// 0x0610(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_FBF213AE471310127AD48E8FCFDFB8A6;// 0x0890(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_31A733DD44B66B19227A9DB473422B74;// 0x0B10(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_D724444E450F207DCCF56BA0924D1BDD;// 0x0D90(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_A3343E5146407BF1153478B18226CBF5;// 0x1010(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_799FF08C4AE6A02392134BA990555C5A;// 0x1290(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_B97A99F54B9C36B8591BF881A2CC855D;// 0x1510(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_360C4C7B48FD61F1218E299776C618F6;// 0x1790(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_967427C845107214E25B858D419F9346;// 0x1A10(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_34CDE44947600378D8934E969F58DB3D;// 0x1C90(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_34E33F904DED201397E5E0982242FAB0;// 0x1F10(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_B448C00C4B81425AA0595CBEB708EF34;// 0x2190(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_8F07458844A2E56A1C5762AF8D421F55;// 0x2410(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_E6F24E9F42D8F4CA39DFEF8DD4B476D6;// 0x2690(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_968F22FF4E3BB56D80E75D975F6F4AB6;// 0x2910(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_A88DBED842B20BD4EB7B26AE3E56C09B;// 0x2B90(0x0280)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_E7CA7FA943D736F966736C8D56C4A8C2;// 0x2E10(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2F5612394BDF5A2849C2A381FC9E5366;// 0x2EB8(0x0050)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_F1FB8086446FA71D0349EEAD4DB7BEC4;// 0x2F08(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8C502A4D4F7633B5C7B339B75D072417;// 0x2FD8(0x0050)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_16CEB6F54AC181C52BE95088A503646C;// 0x3028(0x0280)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2D13BE46497771FDAE86E4908B22898A;// 0x32A8(0x00A8)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_BB165419434B823609A22DBA230B8D2D;// 0x3350(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_4D6DAD0C42C9F2DA8758B6AC002CE915;// 0x35D0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_5EF9CE9342E94FB694478E87C3C7F74C;// 0x3850(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_A4C849304786734FF2CBB38001609E6E;// 0x3AD0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_CD11AD444D1581BC094396BFD1725C00;// 0x3D50(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_6691526D442AF563678E539D646CE6DB;// 0x3FD0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_8FC756824BD6CC0B2C7B4AA20C0BBA5C;// 0x4250(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_ECB4544A48DF8459E188F6A9A6375454;// 0x44D0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_BDFAE8A84BBA0BF92449028F38FCAA25;// 0x4750(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_B6C004D64F36D6E66E449E942F98D950;// 0x49D0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_7B0A119C441F57425496FEB85FA9F221;// 0x4C50(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_F2CC06D64916451825BB71B069D7ACE2;// 0x4ED0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_805E1F8946FF6C2EC0FE7CA197DFE282;// 0x5150(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_9006B4024CD8E37415329287FF5FE955;// 0x53D0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_E3A41E7A462238D4E8787D91CE3E8A22;// 0x5650(0x0280)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AD726B604ED046D49519E5B1F4F314A6;// 0x58D0(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CEFC908743CE8FDDE56CEE8FB1051EDC;// 0x5988(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_080CC1174DA46065556E869E8AB83802;// 0x5A40(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C90495684BA97F0980DE18A0EA7769FC;// 0x5AF8(0x00B8)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_447334154A90172F3F8665B34F3AA6BD;// 0x5BB0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_3F4B4B7046392B6A40FA90A94FCF9958;// 0x5E30(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_E12DAB504E8F4F3A7612088710D52F22;// 0x60B0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_4FA0E88549A11D14E555D2A815F0F695;// 0x6330(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_3784B03B48730B1A5D3070B19D1A8713;// 0x65B0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_474230774A85D24C52B353B0D8CF018B;// 0x6830(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_DF9B8D464D65EAFF8E9784AFC28A1939;// 0x6AB0(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_E919B0134A93C84C623173AAB7F31784;// 0x6D30(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_810AC4C94BED1E0B2873E783425B4FF0;// 0x6FB0(0x0280)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9C046A484F831DC66FA5149223CC4D77;// 0x7230(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F8F122F949E38D343CE6B1AA783FAB43;// 0x72E8(0x00B8)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_AAA8FAB54BD3586B8EAAAB991D9AA65F;// 0x73A0(0x00E8)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_931D93BC4E030E664BAEE190C6BA8FC3;// 0x7488(0x00E8)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_AED39C8F40F3B4F4262B149EE54BE6D6;// 0x7570(0x00E8)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_F378BCDE4EDDD4A5C632BBAD6287FF79;// 0x7658(0x00E8)
	struct FAnimNode_SubInput                          AnimGraphNode_SubInput_1FCA6B1941FE524E8211878021F2F284;  // 0x7740(0x0068)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_49BECA584FF54F0A196E9DB310A717A1;// 0x77A8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_E1C819C2446E1F5984F98F97A65316E4;// 0x7A28(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_4EA635A24D1FFE5AFA8F409FB32FBC24;// 0x7CA8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_A87B768F476CC134D5ECC586ACEDFB52;// 0x7F28(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_198C8EBC4EDBC934F0CFB4A5190406BE;// 0x81A8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_207C1197405FBEA67EF4F0AAB5B4883F;// 0x8428(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_79B9A0CE4CC08A4C921273BB8A01927B;// 0x86A8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_65B71F2842894CCE25C260AFC0D294FF;// 0x8928(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_4AA256F945769D01203F4687FB9187FF;// 0x8BA8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_DD945AE248850206ED81F8A9E12EAB64;// 0x8E28(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_5B842B15492DD30A85232EB5611C086A;// 0x90A8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_36FD76464D1DA29686DB02B620C1D71A;// 0x9328(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_B25D2EE84E32B171BEEA9B97FCC1EA89;// 0x95A8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_4D30CCCB4EB95EEBC66DEF9988A32FD2;// 0x9828(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_1C40C93B42DE453B9ABEC3BA2A51AE6E;// 0x9AA8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_A5D0863A43BF7E2EBA757E8A8FB923A3;// 0x9D28(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_2B7E2A744CF7EDEA6C699CA43A67DF2F;// 0x9FA8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_F06010BC43122D7FC29F09A340F72ECE;// 0xA228(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_9CDB568C40D1655B3940368751008585;// 0xA4A8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_CEE2BCB147998EA3EB857D9616C52DD2;// 0xA728(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_F267CFE54B5108445A8275A31923370D;// 0xA9A8(0x0280)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_2183C1414B474D2A31C901BBC35C73A8;// 0xAC28(0x00E8)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_9E2D4D4042D893A4E247BA911E48B6A1;// 0xAD10(0x00E8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1203B6474E3A9B66E8EB89BA043FC8CF;// 0xADF8(0x00B8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_325411C14A45003F11B419B65EE1509C;// 0xAEB0(0x00B8)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_092F499A44E06C908B89909FD0A88F78;// 0xAF68(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_C3AD77324DDC34C16C257CA9002EEE2F;// 0xB1E8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_75205F5B44FF3C645262B49FE2A5DF55;// 0xB468(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_90823BD7499549AF28D317B259E29DB0;// 0xB6E8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_1CB307314A675FE93FC73BABF84AD83F;// 0xB968(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_5F4B995A4B79FCC7C60E5EB0EE2DB2EF;// 0xBBE8(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_FEB20038435F5D6AFC2249AD074910B6;// 0xBE68(0x0280)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7D03A0B54B263956929A7D9F8CBA7B41;// 0xC0E8(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_08EB9D9A4CDEC1CFE676E79261CAEE69;// 0xC130(0x0048)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_EB67795942572863632E5FB3A92E84B2;// 0xC178(0x00E8)
	struct FAnimNode_BoneDrivenController              AnimGraphNode_BoneDrivenController_E7079335421C1A31C7C22780BD74D4DC;// 0xC260(0x00E8)
	struct FAnimNode_Root                              AnimGraphNode_Root_857923E44CC339CF311440B4D3B0E044;      // 0xC348(0x0048)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_C964500943EBF9690F7D7098B2013E88;// 0xC390(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_9416FEC44D681EAF065E80B70B19DA08;// 0xC610(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_FF6057574BBCE789C53A9C9106FDE5D7;// 0xC890(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_461A1FA24E947D587F846C95E9BB81B9;// 0xCB10(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_01967D4347E640D1711C94B81EF0A929;// 0xCD90(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_41FC9D0041B40C8749BBC89B4C6DC038;// 0xD010(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_E27DE33D4D641F303DD72A8BE9F731D0;// 0xD290(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_7E493B824BCB2CFCCC4F6AB9BCB8C52A;// 0xD510(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_FBF1CE3947118731A2A8269EF1B6EABF;// 0xD790(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_EB27D61B4C65F01E96FB48B43158F41E;// 0xDA10(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_307FDBCD4F6EB7450D89A8B385EC8495;// 0xDC90(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_A75B97414077C2E80D2B7CA024A90A5A;// 0xDF10(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_6B95FABA4BECC18AD5B72E8A74BC0D43;// 0xE190(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_999F20F64527328C94A834A6F38A62E1;// 0xE410(0x0280)
	struct FAnimNode_AnimDynamics                      AnimGraphNode_AnimDynamics_C70EA47147E6C24B8D3455AE9884AE0D;// 0xE690(0x0280)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_239992334BFBEE8B61BE39AC37B34E19;// 0xE910(0x00B8)
	float                                              eblade_back_alpha;                                        // 0xE9C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SkirtLightAlpha;                                          // 0xE9CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SkirtHeavyAlpha;                                          // 0xE9D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              TabardAdjustAlpha;                                        // 0xE9D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsClient;                                                 // 0xE9D8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsUsingIdleCache;                                         // 0xE9D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               IsZeroVelocity;                                           // 0xE9DA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0xE9DB(0x0001) MISSED OFFSET
	float                                              hip_jiggle_r_rotz_alpha;                                  // 0xE9DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Global_Alpha;                                             // 0xE9E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              bangs_alpha;                                              // 0xE9E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              linear_damping_override;                                  // 0xE9E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Feminine_lantern_offset;                                  // 0xE9EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass P_male_postprocessing_animbp.P_male_postprocessing_animbp_C");
		return ptr;
	}


	void DisableDynamics();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_7E493B824BCB2CFCCC4F6AB9BCB8C52A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_FBF1CE3947118731A2A8269EF1B6EABF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_E27DE33D4D641F303DD72A8BE9F731D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_41FC9D0041B40C8749BBC89B4C6DC038();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_01967D4347E640D1711C94B81EF0A929();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_461A1FA24E947D587F846C95E9BB81B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_FF6057574BBCE789C53A9C9106FDE5D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_9416FEC44D681EAF065E80B70B19DA08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_C964500943EBF9690F7D7098B2013E88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_BoneDrivenController_E7079335421C1A31C7C22780BD74D4DC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_5F4B995A4B79FCC7C60E5EB0EE2DB2EF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_1CB307314A675FE93FC73BABF84AD83F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_90823BD7499549AF28D317B259E29DB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_75205F5B44FF3C645262B49FE2A5DF55();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_C3AD77324DDC34C16C257CA9002EEE2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_092F499A44E06C908B89909FD0A88F78();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_BoneDrivenController_9E2D4D4042D893A4E247BA911E48B6A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_F267CFE54B5108445A8275A31923370D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_CEE2BCB147998EA3EB857D9616C52DD2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_9CDB568C40D1655B3940368751008585();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_F06010BC43122D7FC29F09A340F72ECE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_EB27D61B4C65F01E96FB48B43158F41E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_2B7E2A744CF7EDEA6C699CA43A67DF2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_E919B0134A93C84C623173AAB7F31784();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_DF9B8D464D65EAFF8E9784AFC28A1939();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_474230774A85D24C52B353B0D8CF018B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_3784B03B48730B1A5D3070B19D1A8713();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_4FA0E88549A11D14E555D2A815F0F695();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_E12DAB504E8F4F3A7612088710D52F22();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_3F4B4B7046392B6A40FA90A94FCF9958();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_447334154A90172F3F8665B34F3AA6BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_ModifyBone_C90495684BA97F0980DE18A0EA7769FC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_ModifyBone_080CC1174DA46065556E869E8AB83802();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_9006B4024CD8E37415329287FF5FE955();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_805E1F8946FF6C2EC0FE7CA197DFE282();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_F2CC06D64916451825BB71B069D7ACE2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_7B0A119C441F57425496FEB85FA9F221();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_B6C004D64F36D6E66E449E942F98D950();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_BDFAE8A84BBA0BF92449028F38FCAA25();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_ECB4544A48DF8459E188F6A9A6375454();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_8FC756824BD6CC0B2C7B4AA20C0BBA5C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_6691526D442AF563678E539D646CE6DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_CD11AD444D1581BC094396BFD1725C00();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_A4C849304786734FF2CBB38001609E6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_5EF9CE9342E94FB694478E87C3C7F74C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_4D6DAD0C42C9F2DA8758B6AC002CE915();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_BB165419434B823609A22DBA230B8D2D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_16CEB6F54AC181C52BE95088A503646C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_BlendListByBool_F1FB8086446FA71D0349EEAD4DB7BEC4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_A88DBED842B20BD4EB7B26AE3E56C09B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_968F22FF4E3BB56D80E75D975F6F4AB6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_E6F24E9F42D8F4CA39DFEF8DD4B476D6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_8F07458844A2E56A1C5762AF8D421F55();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_B448C00C4B81425AA0595CBEB708EF34();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_34E33F904DED201397E5E0982242FAB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_34CDE44947600378D8934E969F58DB3D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_967427C845107214E25B858D419F9346();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_307FDBCD4F6EB7450D89A8B385EC8495();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_360C4C7B48FD61F1218E299776C618F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_B97A99F54B9C36B8591BF881A2CC855D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_799FF08C4AE6A02392134BA990555C5A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_A3343E5146407BF1153478B18226CBF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_D724444E450F207DCCF56BA0924D1BDD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_31A733DD44B66B19227A9DB473422B74();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_FBF213AE471310127AD48E8FCFDFB8A6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_A75B97414077C2E80D2B7CA024A90A5A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_DC1D6E84429A24E4F81C51982DC36757();
	void BlueprintUpdateAnimation(float* DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_6B95FABA4BECC18AD5B72E8A74BC0D43();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_0BDBFA2849868DF53DB2518174CD4C79();
	void SetSecondaryMotion(float SkirtHeavyAlpha, float SkirtLightAlpha, float TabardAdjustAlpha);
	void UpdateAimOffsetTarget(const struct FVector& Target);
	void EnableAimOffset(bool Enable);
	void SetCBladePullAimRotation(const struct FRotator& Rotation);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_999F20F64527328C94A834A6F38A62E1();
	void SetCBladePullAimTarget(class UPrimitiveComponent* AimTarget);
	void SetCBladeEnablePullAim(bool Enable);
	void SetCBladePullAttachTarget(class UPrimitiveComponent* AttachTarget, const struct FVector& ImpactPoint);
	void SetIsClient(bool IsClient);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_AnimDynamics_C70EA47147E6C24B8D3455AE9884AE0D();
	void SetWeaponOnBack(bool OnBack);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_P_male_postprocessing_animbp_AnimGraphNode_ModifyBone_239992334BFBEE8B61BE39AC37B34E19();
	void ExecuteUbergraph_P_male_postprocessing_animbp(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
