#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Basic.hpp"
#include "UE4_CoreUObject_classes.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct simplified_blackboard_key_data.simplified_blackboard_key_data
// 0x003C
struct Fsimplified_blackboard_key_data
{
	struct FName                                       BlackboardKeyName_36_D95F6FB442C4C4B147C0138CE50CEAB1;    // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               ConstantBool_28_F3E1D81845AB1DF5982C8DBE16F22976;         // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	int                                                ConstantInt_29_10E0A152490EA2A12C07A1B11061E074;          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ConstantFloat_30_D5DF78A946DE82A40911F9B8E315F6B0;        // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	class UObject*                                     ConstantObject_31_A12CFADC4F1BA26E8499309B88E475D6;       // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UClass*                                      ConstantClass_32_200C671045B6174BEF4C9BB102498D83;        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       ConstantName_33_06CAF9424D6716E7E24AADBF3B25544E;         // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     ConstantVector_39_7BF9CC8E4A320675AF2F0E867948CD2A;       // 0x0030(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
