#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct facial_anim_struct.facial_anim_struct
// 0x0038
struct Ffacial_anim_struct
{
	struct FName                                       BaseMorphTargetName_18_B4E640884E4D983B29F9D8A88243A81F;  // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CorrectiveLEyeUpper_9_3A81C82342ADE920955C8588303A3189;   // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CorrectiveLEyeLower_10_443A11644845C1A97FCDC5BD1D8B35F7;  // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CorrectiveREyeUpper_15_4B7E38EE4E662E7EBB7945996788FBA1;  // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CorrectiveREyeLower_16_49118F61492870CF7DA0CB9FAC87176B;  // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CorrectiveLEyeUpperBig_23_1C22722047711C49FCF68AB4F9250257;// 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       CorrectiveREyeUpperBig_25_33F763814651B4A08B6AC8A1CC9A0827;// 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
