#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Archon_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Archon.AbilityActor
// 0x0080 (0x0408 - 0x0388)
class AAbilityActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0388(0x0020) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnTakeAbilityDamage;                                      // 0x03A8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	float                                              GlobalResistance;                                         // 0x03B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ElementalResistance;                                      // 0x03BC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicalResistance;                                       // 0x03C0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlameResistance;                                          // 0x03C4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FrostResistance;                                          // 0x03C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShockResistance;                                          // 0x03CC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiantResistance;                                        // 0x03D0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UmbralResistance;                                         // 0x03D4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicalMultiplicativeResistance;                         // 0x03D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlameMultiplicativeResistance;                            // 0x03DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FrostMultiplicativeResistance;                            // 0x03E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShockMultiplicativeResistance;                            // 0x03E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiantMultiplicativeResistance;                          // 0x03E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UmbralMultiplicativeResistance;                           // 0x03EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              StartHealth;                                              // 0x03F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x14];                                      // 0x03F4(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.AbilityActor");
		return ptr;
	}


	void ReceivedArchonAbilityDamage(float DamageReceived, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonAbilityDamageInfo& DamageInfo);
	void ReceiveArchonRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, TArray<struct FHitResult> HitInfos, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonExtendedDamageInfo& InExtendedDamageInfo);
	void ReceiveArchonPointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonExtendedDamageInfo& InExtendedDamageInfo);
	void ReceiveArchonDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser, class UPrimitiveComponent* HitComponent, const struct FArchonExtendedDamageInfo& InExtendedDamageInfo);
};


// Class Archon.ActionHelper
// 0x0008 (0x0390 - 0x0388)
class AActionHelper : public AActor
{
public:
	float                                              Score;                                                    // 0x0388(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x038C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ActionHelper");
		return ptr;
	}

};


// Class Archon.AddMemberLobbyCallbackProxy
// 0x0050 (0x0078 - 0x0028)
class UAddMemberLobbyCallbackProxy : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnSuccess;                                                // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFailure;                                                // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0048(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.AddMemberLobbyCallbackProxy");
		return ptr;
	}


	class UAddMemberLobbyCallbackProxy* STATIC_AddMember(class UObject* WorldContextObject, class APlayerController* PlayerController, const struct FUniqueNetIdRepl& InMemberId);
};


// Class Archon.ArchonFeature
// 0x0010 (0x0038 - 0x0028)
class UArchonFeature : public UObject
{
public:
	struct FName                                       Description;                                              // 0x0028(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bEnabled;                                                 // 0x0030(0x0001) (Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData)
	bool                                               bVisibleInUI;                                             // 0x0031(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0032(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonFeature");
		return ptr;
	}

};


// Class Archon.AirShipLobbyFeature
// 0x0000 (0x0038 - 0x0038)
class UAirShipLobbyFeature : public UArchonFeature
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.AirShipLobbyFeature");
		return ptr;
	}

};


// Class Archon.ArchonAbilitySystemBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UArchonAbilitySystemBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAbilitySystemBlueprintLibrary");
		return ptr;
	}


	bool STATIC_TryActivateAbilityBySpecHandle(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAbilitySpecHandle& AbilityToActivate, bool bAllowRemoteActivation);
	struct FGameplayEffectSpecHandle STATIC_SetEffectContext(const struct FGameplayEffectSpecHandle& SpecHandle, const struct FGameplayEffectContextHandle& ContextHandle);
	bool STATIC_IsGameplayEffectActive(const struct FActiveGameplayEffectHandle& ActiveHandle);
	class UGameplayAbility* STATIC_GiveAbility(class UObject* WorldContextObject, class UClass* AbilityClass, float Level, bool bActivateAndRemoveOnEnd, class UAbilitySystemComponent* AbilitySystem, struct FGameplayAbilitySpecHandle* OutAbilitySpecHandle);
	float STATIC_GetTimeRemaining(const struct FActiveGameplayEffectHandle& ActiveHandle);
	float STATIC_GetTimeFromStart(const struct FActiveGameplayEffectHandle& ActiveHandle);
	struct FGameplayTag STATIC_GetTagFromName(const struct FName& Name);
	float STATIC_GetPeriod(const struct FGameplayEffectSpec& GameplayEffectSpec);
	struct FName STATIC_GetNameFromTag(const struct FGameplayTag& Tag);
	struct FGameplayEffectContextHandle STATIC_GetEffectContext(const struct FGameplayEffectSpec& GameplayEffectSpec);
	float STATIC_GetDuration(const struct FGameplayEffectSpec& GameplayEffectSpec);
	float STATIC_GetBaseFloatAttributeFromAbilitySystemComponent(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute);
	float STATIC_GetBaseFloatAttribute(class AActor* Actor, const struct FGameplayAttribute& Attribute, bool* bSuccessfullyFoundAttribute);
	float STATIC_GetActiveDuration(const struct FActiveGameplayEffectHandle& ActiveHandle);
	struct FGameplayEffectContextHandle STATIC_EffectContextSetHitResult(const struct FGameplayEffectContextHandle& EffectContext, const struct FHitResult& Hit);
	class UAbilitySystemComponent* STATIC_EffectContextGetOriginalInstigatorAbilitySystemComponent(const struct FGameplayEffectContextHandle& EffectContext);
	class UAbilitySystemComponent* STATIC_EffectContextGetInstigatorAbilitySystemComponent(const struct FGameplayEffectContextHandle& EffectContext);
	void STATIC_CancelAbilityWithHandle(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayAbilitySpecHandle& AbilityHandle);
	void STATIC_CancelAbilitiesWithTags(class UAbilitySystemComponent* AbilitySystem, const struct FGameplayTagContainer& WithTags, const struct FGameplayTagContainer& WithoutTags);
};


// Class Archon.ArchonAbilitySystemComponent
// 0x0080 (0x1770 - 0x16F0)
class UArchonAbilitySystemComponent : public UAbilitySystemComponent
{
public:
	class UGameplayAbilitySet*                         AbilitySet;                                               // 0x16F0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UArchonGameplayAbilitySet*                   ArchonAbilitySet;                                         // 0x16F8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UGameplayCueSet*>                     GameplayCueSets;                                          // 0x1700(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UCurveFloat*                                 DamageCurve;                                              // 0x1710(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 ElementalDamageCurve;                                     // 0x1718(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 ElementalWeaknessCurve;                                   // 0x1720(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 ElementalStrengthCurve;                                   // 0x1728(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnGameEffectApplied;                                      // 0x1730(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnGameEffectChanged;                                      // 0x1740(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnGameEffectRemoved;                                      // 0x1750(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x10];                                      // 0x1760(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAbilitySystemComponent");
		return ptr;
	}


	void SetActiveGameplayEffectTimeRemaining(const struct FActiveGameplayEffectHandle& ActiveHandle, float NewTimeRemaining);
	void OnGameEffectRemoved__DelegateSignature(const class FString& Name);
	void OnGameEffectChanged__DelegateSignature(const class FString& Name, class UObject* Icon, float Duration, float TimeRemaining, int StackCount);
	void OnGameEffectApplied__DelegateSignature(const class FString& Name, class UObject* Icon, float Duration, int StackCount);
	bool HasAbilityWithTag(const struct FGameplayTagContainer& GameplayTagContainer);
	struct FGameplayAbilitySpecHandle GiveAbilityAndActivateOnce(class UClass* AbilityClass, int Level);
	struct FGameplayAbilitySpecHandle GiveAbility(class UClass* AbilityClass, int Level);
	float GetTimePercentionOfActiveEffectsWithTags(const struct FGameplayTagContainer& Tags);
	class UAnimMontage* GetCurrentAbilityMontage();
	void BP_ClearAbility(const struct FGameplayAbilitySpecHandle& Handle);
};


// Class Archon.ArchonAbilityTargetPlayers
// 0x0000 (0x0550 - 0x0550)
class AArchonAbilityTargetPlayers : public AGameplayAbilityTargetActor_Radius
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAbilityTargetPlayers");
		return ptr;
	}

};


// Class Archon.ArchonAbilityTask_ApplyRootMotionJumpForce
// 0x0060 (0x00E0 - 0x0080)
class UArchonAbilityTask_ApplyRootMotionJumpForce : public UAbilityTask
{
public:
	struct FScriptMulticastDelegate                    OnFinish;                                                 // 0x0080(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FName                                       ForceName;                                                // 0x0090(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    Rotation;                                                 // 0x0098(0x000C) (Net, IsPlainOldData)
	float                                              Distance;                                                 // 0x00A4(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	float                                              Height;                                                   // 0x00A8(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	float                                              Duration;                                                 // 0x00AC(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	float                                              MinimumLandedTriggerTime;                                 // 0x00B0(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00B4(0x0004) MISSED OFFSET
	class UCurveVector*                                PathOffsetCurve;                                          // 0x00B8(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 TimeMappingCurve;                                         // 0x00C0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x00C8(0x0010) MISSED OFFSET
	class UCharacterMovementComponent*                 MovementComponent;                                        // 0x00D8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAbilityTask_ApplyRootMotionJumpForce");
		return ptr;
	}


	void OnLandedCallback(const struct FHitResult& Hit);
	void Finish();
	class UArchonAbilityTask_ApplyRootMotionJumpForce* STATIC_ArchonApplyRootMotionJumpForce(class UGameplayAbility* GameplayAbility, const struct FName& TaskInstanceName, const struct FRotator& Rotation, float Distance, float Height, float Duration, float MinimumLandedTriggerTime, class UCurveVector* PathOffsetCurve, class UCurveFloat* TimeMappingCurve);
};


// Class Archon.ArchonAbilityTask_PlayMontageAndWaitNotifyName
// 0x00A8 (0x0128 - 0x0080)
class UArchonAbilityTask_PlayMontageAndWaitNotifyName : public UAbilityTask
{
public:
	struct FScriptMulticastDelegate                    OnCompleted;                                              // 0x0080(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnBlendOut;                                               // 0x0090(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnInterrupted;                                            // 0x00A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCancelled;                                              // 0x00B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnNotifyBegin;                                            // 0x00C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnNotifyEnd;                                              // 0x00D0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x48];                                      // 0x00E0(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAbilityTask_PlayMontageAndWaitNotifyName");
		return ptr;
	}


	class UArchonAbilityTask_PlayMontageAndWaitNotifyName* STATIC_PlayMontageAndWaitNotifyName(class UGameplayAbility* GameplayAbility, const struct FName& TaskInstanceName, class UAnimMontage* MontageToPlay, float Rate, const struct FName& StartSection, bool bStopWhenAbilityEnds);
	void OnNotifyReceived(const struct FName& NotifyName, uint32_t MontageID);
	void OnNotifyEndReceived(const struct FName& NotifyName, uint32_t MontageID);
	void OnNotifyBeginReceived(const struct FName& NotifyName, uint32_t MontageID);
	void OnMontageInterrupted();
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
};


// Class Archon.ArchonAbilityTask_WaitVelocityBelow
// 0x0020 (0x00A0 - 0x0080)
class UArchonAbilityTask_WaitVelocityBelow : public UAbilityTask
{
public:
	struct FScriptMulticastDelegate                    OnVelocityBelow;                                          // 0x0080(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UMovementComponent*                          CachedMovementComponent;                                  // 0x0090(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0098(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAbilityTask_WaitVelocityBelow");
		return ptr;
	}


	class UArchonAbilityTask_WaitVelocityBelow* STATIC_CreateWaitVelocityBelow(class UGameplayAbility* GameplayAbility, float Magnitude);
};


// Class Archon.ArchonAIController
// 0x0000 (0x0480 - 0x0480)
class AArchonAIController : public AAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAIController");
		return ptr;
	}

};


// Class Archon.ArchonAIBotController
// 0x0000 (0x0480 - 0x0480)
class AArchonAIBotController : public AArchonAIController
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAIBotController");
		return ptr;
	}

};


// Class Archon.ArchonVOComponent
// 0x0000 (0x03E0 - 0x03E0)
class UArchonVOComponent : public USceneComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonVOComponent");
		return ptr;
	}


	bool PostAkEventVO(class UAkAudioEventBase* AkEvent, class UArchonVOUserComponent* UserComponent, bool bPrePostEvents);
	class UArchonSpeaker* GetSpeaker();
};


// Class Archon.ArchonAmbientComponent
// 0x0010 (0x03F0 - 0x03E0)
class UArchonAmbientComponent : public UArchonVOComponent
{
public:
	struct FScriptMulticastDelegate                    OnUserRequestedAmbient;                                   // 0x03E0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAmbientComponent");
		return ptr;
	}


	void OnUserRequestedAmbient__DelegateSignature(class UArchonAmbientUserComponent* User, float DeltaTime);
};


// Class Archon.ArchonVOUserComponent
// 0x0010 (0x01E0 - 0x01D0)
class UArchonVOUserComponent : public UActorComponent
{
public:
	bool                                               bIsVOPlaying;                                             // 0x01D0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x01D1(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonVOUserComponent");
		return ptr;
	}


	void SetVOPlaying(bool bIsPlaying);
	bool IsVOPlaying();
	bool IsInUIInputMode();
	bool IsInGameInputMode();
};


// Class Archon.ArchonAmbientUserComponent
// 0x0000 (0x01E0 - 0x01E0)
class UArchonAmbientUserComponent : public UArchonVOUserComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAmbientUserComponent");
		return ptr;
	}

};


// Class Archon.ArchonAnimInstance
// 0x0118 (0x04A0 - 0x0388)
class UArchonAnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0388(0x0020) MISSED OFFSET
	TMap<class UAnimNotifyState*, class UObject*>      NotifyData;                                               // 0x03A8(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData01[0xA0];                                      // 0x03F8(0x00A0) MISSED OFFSET
	int                                                AnimNotifyWriteIndex;                                     // 0x0498(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LastAnimUpdateTime;                                       // 0x049C(0x0004) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAnimInstance");
		return ptr;
	}


	bool IsPlayingMontageOnSlot(const struct FName& SlotNodeName);
	bool IsNotifyActive(const struct FName& NotifyName, struct FAnimNotifyEvent* OutNotify);
	class UObject* GetNotifyData(class UAnimNotifyState* notify_event);
	void GetMontagesForSlot(const struct FName& SlotName, TArray<class UAnimMontage*>* Montages);
	void ClearAllNotifyData();
	void AddNotifyData(class UAnimNotifyState* notify_event, class UObject* data_object);
};


// Class Archon.ArchonAnimNotify_AbilityNotify
// 0x0008 (0x0040 - 0x0038)
class UArchonAnimNotify_AbilityNotify : public UAnimNotify
{
public:
	struct FName                                       AbilityNotifyName;                                        // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAnimNotify_AbilityNotify");
		return ptr;
	}

};


// Class Archon.ArchonAnimNotify_AbilityNotifyWindow
// 0x0008 (0x0038 - 0x0030)
class UArchonAnimNotify_AbilityNotifyWindow : public UAnimNotifyState
{
public:
	struct FName                                       AbilityNotifyName;                                        // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAnimNotify_AbilityNotifyWindow");
		return ptr;
	}

};


// Class Archon.ArchonAnimNotify_GameplayCue
// 0x0010 (0x0048 - 0x0038)
class UArchonAnimNotify_GameplayCue : public UAnimNotify
{
public:
	struct FGameplayTag                                GameplayCue;                                              // 0x0038(0x0008) (BlueprintReadOnly)
	struct FGameplayCueTag                             Cue;                                                      // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAnimNotify_GameplayCue");
		return ptr;
	}

};


// Class Archon.ArchonAnimNotify_GameplayCueState
// 0x0010 (0x0040 - 0x0030)
class UArchonAnimNotify_GameplayCueState : public UAnimNotifyState
{
public:
	struct FGameplayTag                                GameplayCue;                                              // 0x0030(0x0008) (BlueprintReadOnly)
	struct FGameplayCueTag                             Cue;                                                      // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAnimNotify_GameplayCueState");
		return ptr;
	}

};


// Class Archon.ArchonAppearanceDataStatic
// 0x0000 (0x0028 - 0x0028)
class UArchonAppearanceDataStatic : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAppearanceDataStatic");
		return ptr;
	}


	struct FArchonAppearanceData STATIC_GatherAppearanceData(class AActor* Actor);
};


// Class Archon.ArchonArmorSetItem
// 0x0068 (0x03F0 - 0x0388)
class AArchonArmorSetItem : public AActor
{
public:
	TArray<struct FArmourSetKeyword>                   ArmorSetKeywords;                                         // 0x0388(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<class UClass*>                              Abilities;                                                // 0x0398(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	int                                                AbilityLevel;                                             // 0x03A8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x03AC(0x0004) MISSED OFFSET
	class FString                                      ItemID;                                                   // 0x03B0(0x0010) (Net, ZeroConstructor)
	class UDataTable*                                  ResistanceTable;                                          // 0x03C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EUpgradeableItemLevel                              CurrentLevel;                                             // 0x03C8(0x0001) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x03C9(0x0007) MISSED OFFSET
	struct FName                                       TransmogId;                                               // 0x03D0(0x0008) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x03D8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonArmorSetItem");
		return ptr;
	}


	bool LookupSetItemTableRow(const struct FName& RowName, struct FArmourSetItemResistanceTableData* OutResistanceTableRow);
	struct FName GetTransmogID();
	class FString GetItemID();
	EUpgradeableItemLevel GetCurrentLevel();
};


// Class Archon.ArchonArmor
// 0x0078 (0x0468 - 0x03F0)
class AArchonArmor : public AArchonArmorSetItem
{
public:
	EArmorType                                         ArmourType;                                               // 0x03F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	EArmorTier                                         ArmorTier;                                                // 0x03F1(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x03F2(0x0006) MISSED OFFSET
	struct FDataTableRowHandle                         DefaultPrimaryDye;                                        // 0x03F8(0x0010) (Edit, BlueprintVisible)
	struct FDataTableRowHandle                         DefaultSecondaryDye;                                      // 0x0408(0x0010) (Edit, BlueprintVisible)
	TAssetPtr<class USkeletalMesh>                     MaleSkeletalMesh;                                         // 0x0418(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TAssetPtr<class USkeletalMesh>                     FemaleSkeletalMesh;                                       // 0x0438(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0458(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonArmor");
		return ptr;
	}


	void SetDyeVariant(const struct FDyeVariant& DyeVariant);
	void OnDyeChanged();
	bool LookupResistanceTableRow(const struct FName& RowName, struct FArmourResistanceTableData* OutResistanceTableRow);
	EArmourDyeSurfaceType GetSecondaryDyeSurface();
	int GetSecondaryDyeRowIndex();
	EArmourDyeSurfaceType GetPrimaryDyeSurface();
	int GetPrimaryDyeRowIndex();
	void BP_OnArmourUnEquipped();
	void BP_OnArmourEquipped();
};


// Class Archon.ArchonArrayExtensions
// 0x0000 (0x0028 - 0x0028)
class UArchonArrayExtensions : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonArrayExtensions");
		return ptr;
	}


	bool STATIC_Map_KeyValueAt(TMap<int, int> TargetMap, int Index, int* Key, int* Value);
	bool STATIC_Array_HaveCommonItems(TArray<int> A, TArray<int> B);
};


// Class Archon.ArchonAttributeComponent
// 0x0060 (0x0230 - 0x01D0)
class UArchonAttributeComponent : public UActorComponent
{
public:
	TArray<struct FArchonAttribute>                    DefaultAttributes;                                        // 0x01D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TMap<struct FName, struct FArchonAttribute>        Attributes;                                               // 0x01E0(0x0050) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonAttributeComponent");
		return ptr;
	}


	void RemoveAttributeModifierByName(const struct FName& AttributeName, const struct FName& ModifierName, bool RemoveAllMatching);
	void RemoveAttributeModifier(const struct FName& AttributeName, const struct FArchonAttributeModifier& Modifier);
	void RemoveAttribute(const struct FName& AttributeName);
	bool GetAttributeValue(const struct FName& AttributeName, float* Value);
	void AddAttributeModifier(const struct FName& AttributeName, const struct FArchonAttributeModifier& Modifier);
	void AddAttribute(const struct FArchonAttribute& Attribute);
};


// Class Archon.ArchonBanner
// 0x0180 (0x0508 - 0x0388)
class AArchonBanner : public AActor
{
public:
	struct FBannerCustomizationItemIDs                 CustomizationItemIDs;                                     // 0x0388(0x0080) (BlueprintVisible, BlueprintReadOnly, Net)
	class UDataTable*                                  CustomizationTable;                                       // 0x0408(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UDataTable*                                  DyeItemsTable;                                            // 0x0410(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TAssetPtr<class USkeletalMesh>                     BannerMesh;                                               // 0x0418(0x0020) (BlueprintVisible, BlueprintReadOnly)
	TAssetPtr<class UMaterialInstance>                 FabricMaterial;                                           // 0x0438(0x0020) (BlueprintVisible, BlueprintReadOnly)
	TAssetPtr<class UAnimSequenceBase>                 BannerAnimation;                                          // 0x0458(0x0020) (BlueprintVisible, BlueprintReadOnly)
	class FString                                      BackgroundColourRowName;                                  // 0x0478(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TAssetPtr<class UTexture>                          BorderPattern;                                            // 0x0488(0x0020) (BlueprintVisible, BlueprintReadOnly)
	class FString                                      BorderColourRowName;                                      // 0x04A8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TAssetPtr<class UTexture>                          SigilPattern;                                             // 0x04B8(0x0020) (BlueprintVisible, BlueprintReadOnly)
	class FString                                      SigilColourRowName;                                       // 0x04D8(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	TAssetPtr<class UParticleSystem>                   VFX;                                                      // 0x04E8(0x0020) (BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBanner");
		return ptr;
	}


	void OnRepCustomizationData();
	void LoadBannerTableData();
	void BP_ApplyCustomizationData();
};


// Class Archon.ArchonBehemoth
// 0x0190 (0x0930 - 0x07A0)
class AArchonBehemoth : public ACharacter
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x07A0(0x0038) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnTakeAbilityDamage;                                      // 0x07D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTakeAbilityDamageOnMonsterPart;                         // 0x07E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FGameplayTagContainer                       OwnedTagsContainer;                                       // 0x07F8(0x0020) (Edit, BlueprintVisible)
	EElementType                                       PrimaryOffenseElementType;                                // 0x0818(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0819(0x0007) MISSED OFFSET
	class UDataTable*                                  DamageDataTable;                                          // 0x0820(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalPower;                                              // 0x0828(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ElementalPower;                                           // 0x082C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PhysicalPower;                                            // 0x0830(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FlamePower;                                               // 0x0834(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FrostPower;                                               // 0x0838(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ShockPower;                                               // 0x083C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RadiantPower;                                             // 0x0840(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              UmbralPower;                                              // 0x0844(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              RawElementalPower;                                        // 0x0848(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              GlobalResistance;                                         // 0x084C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ElementalResistance;                                      // 0x0850(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicalResistance;                                       // 0x0854(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlameResistance;                                          // 0x0858(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FrostResistance;                                          // 0x085C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShockResistance;                                          // 0x0860(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiantResistance;                                        // 0x0864(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UmbralResistance;                                         // 0x0868(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PhysicalMultiplicativeResistance;                         // 0x086C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FlameMultiplicativeResistance;                            // 0x0870(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FrostMultiplicativeResistance;                            // 0x0874(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ShockMultiplicativeResistance;                            // 0x0878(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RadiantMultiplicativeResistance;                          // 0x087C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              UmbralMultiplicativeResistance;                           // 0x0880(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxTimeDeltaForSimulatedFixup;                            // 0x0884(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAbilitySystemComponent*                     AbilitySystemComponent;                                   // 0x0888(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UArchonBuffableComponent*                    ArchonBuffableComponent;                                  // 0x0890(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x98];                                      // 0x0898(0x0098) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBehemoth");
		return ptr;
	}


	void UpdateTurnWarpTarget(const struct FVector& InTarget);
	void UpdatePrimaryOffenseElement(EElementType NewPrimaryOffenseElement);
	void UpdateBaseResists(bool bUpdatePartsAsWell);
	void UpdateBasePowers();
	void TraversalEnded(bool bSuccess);
	void ReceivedArchonAbilityDamageOnMonsterPart(class AMonsterPartActor* MonsterPartActor, float DamageReceived, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonAbilityDamageInfo& DamageInfo);
	void ReceivedArchonAbilityDamage(float DamageReceived, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonAbilityDamageInfo& DamageInfo);
	void ReceiveArchonRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, TArray<struct FHitResult> HitInfos, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonExtendedDamageInfo& InExtendedDamageInfo);
	void ReceiveArchonPointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const struct FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonExtendedDamageInfo& InExtendedDamageInfo);
	void ReceiveArchonDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser, class UPrimitiveComponent* HitComponent, const struct FArchonExtendedDamageInfo& InExtendedDamageInfo);
	void PostInitializeHealth();
	void OnStartTraversal(const struct FVector& Delta);
	void OnRep_CurrentHealth();
	struct FDamageEventData OnPreMitigateOutgoingDamageBP(class AActor* DamageTaker, const struct FDamageEventData& DamageEventData, const struct FGameplayTagContainer& DamageEventTags, bool bHasHitResult, const struct FHitResult& HitResult, bool* bOverrideDamageData, struct FGameplayTagContainer* OutDamageEventTags);
	void OnMovementUpdated(float DeltaTime, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnDeath();
	void InitializeHealth(float InitialHealth);
	void HandleCharacterMovementUpdated(float DeltaTime, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	TArray<class UAnimMontage*> GetPivotMontages();
	void GetPivotMontageForAngleDelta(float Angle, class UAnimMontage** Montage);
	class UMonsterPartComponent* GetPartForBone(const struct FName& Bone);
	float GetMaxHealth();
	struct FTransform GetExtractedRootMotionForMontage(class UAnimMontage* Montage, float StartTime, float EndTime);
	struct FTransform GetExtractedRootMotion(float DeltaTime, bool Looping);
	bool GetDamageInfo(const struct FName& DamageKey, struct FDamageTableData* DamageInfo);
	float GetCurrentHealth();
	void FixupCapsuleUpVector();
	struct FGameplayTagContainer BP_GetTagsToApplyPostDamageCalculation(float DamageApplied, class AActor* TargetActor);
	void BP_DamageGiven(float DamageReceived, class AActor* DamageReceiver, const struct FArchonAbilityDamageInfo& DamageInfo);
	void ApproximatePivotDelta(float Angle, struct FTransform* Delta);
};


// Class Archon.ArchonBehemothAttributeSet
// 0x0008 (0x0038 - 0x0030)
class UArchonBehemothAttributeSet : public UAttributeSet
{
public:
	float                                              AetherCharge;                                             // 0x0030(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	float                                              Rage;                                                     // 0x0034(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBehemothAttributeSet");
		return ptr;
	}

};


// Class Archon.ArchonBehemothMovementComponent
// 0x0030 (0x0870 - 0x0840)
class UArchonBehemothMovementComponent : public UCharacterMovementComponent
{
public:
	struct FScriptMulticastDelegate                    OnNavLinkTraversalStateChangedDelegate;                   // 0x0840(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0850(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBehemothMovementComponent");
		return ptr;
	}

};


// Class Archon.ArchonBuff
// 0x0330 (0x06B8 - 0x0388)
class AArchonBuff : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0388(0x0008) MISSED OFFSET
	EArchonBuffStackStrategy                           StackStrategy;                                            // 0x0390(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0391(0x0003) MISSED OFFSET
	float                                              MaxDuration;                                              // 0x0394(0x0004) (Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	struct FHitResult                                  HitResult;                                                // 0x0398(0x0090) (BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData)
	bool                                               bRemoveBuffWhenGameplayEffectsRemoved;                    // 0x0428(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0429(0x0007) MISSED OFFSET
	TArray<struct FEffectDef>                          GameplayEffects;                                          // 0x0430(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TWeakObjectPtr<class UArchonAbilitySystemComponent> OwnerAbilitySystemComponent;                              // 0x0440(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	TWeakObjectPtr<class UArchonAbilitySystemComponent> InstigatorAbilitySystemComponent;                         // 0x0448(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	TWeakObjectPtr<class UArchonBuffableComponent>     OwnerBuffableComponent;                                   // 0x0450(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0458(0x0008) MISSED OFFSET
	TArray<struct FActiveGameplayEffectHandle>         ActiveGameplayEffects;                                    // 0x0460(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FInheritedTagContainer                      InheritableArchonBuffTags;                                // 0x0470(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FInheritedTagContainer                      InheritableOwnedTagsContainer;                            // 0x04D0(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FGameplayTagRequirements                    OngoingTagRequirements;                                   // 0x0530(0x0040) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FGameplayTagRequirements                    ApplicationTagRequirements;                               // 0x0570(0x0040) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FInheritedTagContainer                      RemoveArchonBuffsWithTags;                                // 0x05B0(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FInheritedTagContainer                      MonitoredGameplayTags;                                    // 0x0610(0x0060) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<struct FGameplayTag>                        MonitoredGameplayEvents;                                  // 0x0670(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	bool                                               bActive;                                                  // 0x0680(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0681(0x0007) MISSED OFFSET
	class UAbilitySystemComponent*                     AbilitySystemComponent;                                   // 0x0688(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData05[0x28];                                      // 0x0690(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBuff");
		return ptr;
	}


	void UpdateExpireTime(float NewDuration, bool EndIfZeroOrBelow);
	void StartBuff();
	void OnTimeOut();
	void OnTagRemoved(const struct FGameplayTag& Tag);
	void OnTagAdded(const struct FGameplayTag& Tag);
	void OnRep_Active();
	void OnRemoved();
	void OnRefreshed();
	void OnGameplayEventTriggered(const struct FGameplayEventData& Payload);
	void OnGameplayEffectRemoved();
	void OnDamageReceived(float DamageReceived, class AController* InstigatedBy, class AActor* DamageCauser, const struct FArchonAbilityDamageInfo& DamageInfo);
	void OnDamageGiven(float DamageReceived, class AActor* DamageReceiver, const struct FArchonAbilityDamageInfo& DamageInfo);
	void OnAdded();
	void OnActiveGameplayEffectRemoved();
	void MulticastOnRefreshedInternal();
	void MulticastOnRefreshed();
	void MulticastOnAdded();
	class AActor* GetBuffOwner();
	void CustomRefresh();
	float AuthGetCurrentDuration();
};


// Class Archon.ArchonBuffableComponent
// 0x0180 (0x0350 - 0x01D0)
class UArchonBuffableComponent : public UActorComponent
{
public:
	TWeakObjectPtr<class UArchonAbilitySystemComponent> OwnerAbilitySystemComponent;                              // 0x01D0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x178];                                     // 0x01D8(0x0178) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBuffableComponent");
		return ptr;
	}


	class AArchonBuff* TryAddBuff(class UClass* BuffClass, const struct FHitResult& HitResult, class AActor* BuffInstigator, bool StartBuff, bool* BuffAdded);
	class AArchonBuff* SpawnAndAddBuff(class UClass* BuffClass, class UAbilitySystemComponent* IntstigatorAbilitySystemComponent, bool StartBuff, const struct FHitResult& HitResult);
	void RemoveBuffByClass(class UClass* Buff);
	void RemoveBuff(class AArchonBuff* Buff);
	bool HasBuff(class UClass* BuffClass);
	int GetStackCount(class UClass* BuffClass);
	void FindAllBuffsOfClass(class UClass* BuffClass, TArray<class AArchonBuff*>* OutBuffs);
	class AArchonBuff* CustomStackAdd(class UClass* Buff, class AActor* BuffInstigator, bool StartBuff, TArray<class AArchonBuff*>* CurrentBuffs);
	bool CanAddBuff(class UClass* BuffClass);
};


// Class Archon.ArchonBuffableInterface
// 0x0000 (0x0028 - 0x0028)
class UArchonBuffableInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonBuffableInterface");
		return ptr;
	}

};


// Class Archon.ArchonCatalog
// 0x00F8 (0x0120 - 0x0028)
class UArchonCatalog : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	TMap<class FString, struct FArchonCatalogItem>     Catalog;                                                  // 0x0030(0x0050) (ZeroConstructor)
	TMap<uint32_t, class FString>                      CrCToNameLookup;                                          // 0x0080(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x50];                                      // 0x00D0(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonCatalog");
		return ptr;
	}


	void ParseFromEconomy(class UPlayFabEconomyDataAsset* Economy);
	bool ItemHasTag(const struct FArchonCatalogItem& CatalogItem, const class FString& Tag);
	bool IsAvailable();
	bool GetRandomItemWithTag(const class FString& Tag, struct FArchonCatalogItem* ArchonCatalogItem);
	void GetQuestRewards(const struct FName& QuestName, TArray<struct FCatalogItemRewardInfo>* Rewards);
	void GetItemsByTag(const class FString& Tag, TArray<struct FArchonCatalogItem>* OutResult);
	void GetItemRewardIcon(const struct FArchonCatalogItem& CatalogItem, TAssetPtr<class UTexture2D>* Icon);
	class FString GetItemCustomValue(const struct FArchonCatalogItem& CatalogItem, const struct FName& Key);
	class UObject* GetItemClassDefaultObject(const struct FArchonCatalogItem& CatalogItem);
	class UClass* GetItemArmorClass(const struct FArchonCatalogItem& CatalogItem);
	bool GetCatalogItem(const class FString& ItemID, struct FArchonCatalogItem* OutCatalogItem);
	void GetAllItems(TArray<struct FArchonCatalogItem>* OutResult);
};


// Class Archon.ArchonCellManagerComponent
// 0x0000 (0x01D0 - 0x01D0)
class UArchonCellManagerComponent : public UActorComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonCellManagerComponent");
		return ptr;
	}


	void RemoveCellBonuses();
	void ApplyCellBonuses(TArray<struct FAppliedCellEffectCounter> EquippedCellEffects);
};


// Class Archon.ArchonCharacterBase
// 0x0010 (0x07B0 - 0x07A0)
class AArchonCharacterBase : public ACharacter
{
public:
	class UArchonCharacterMovementComponent*           CharMovement;                                             // 0x07A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x07A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Archon.ArchonCharacterBase");
		return ptr;
	}

};


// Class Archon.ArchonCharacter
// 0x0260 (0x0A10 - 0x07B0)
class AArchonCharacter : public AArchonCharacterBase
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x07B0(0x0030) MISSED OFFSET
	struct FVector                                     DesiredDodgeDirection;                                    // 0x07E0(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x07EC(0x0004) MISSED OFFSET
	class AArchonWeapon*                               Weapon;                                                   // 0x07F0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EArchonBodyType                                    BodyType;                                                 // 0x07F8(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	EArchonGender                                      GenderId;                                                 // 0x07F9(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x07FA(0x0002) MISSED OFFSET
	float                                              AttackTargetScore;                                        // 0x07FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UAbilitySystemComponent*                     AbilitySystemComponent;                                   // 0x0800(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UArchonBuffableComponent*                    ArchonBuffableComponent;                                  // 0x0808(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FGameplayTagContainer                       InvincibilityTags;                                        // 0x0810(0x0020) (Edit)
	float                                              DesiredHeading;                                           // 0x0830(0x0004) (Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0834(0x0004) MISSED OFFSET
	class AArchonArmor*                                HelmetArmour;                                             // 0x0838(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AArchonArmor*                                ChestArmour;                                              // 0x0840(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AArchonArmor*                                LegsArmour;                                               // 0x0848(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AArchonArmor*                                ArmsArmour;                                               // 0x0850(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AArchonLantern*                              Lantern;                                                  // 0x0858(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
