#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Options_Menu_VIDEO_bpw_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// WidgetBlueprintGeneratedClass Options_Menu_VIDEO_bpw.Options_Menu_VIDEO_bpw_C
// 0x0120 (0x03F0 - 0x02D0)
class UOptions_Menu_VIDEO_bpw_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x02D0(0x0008) (Transient, DuplicateTransient)
	class Uw_Options_Entry_PickerBox_bpw_C*            adv_AA;                                                   // 0x02D8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            adv_Effects;                                              // 0x02E0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            ADV_GraphicQuality;                                       // 0x02E8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            adv_PostProcess;                                          // 0x02F0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            adv_Shadows;                                              // 0x02F8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            adv_Textures;                                             // 0x0300(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            adv_ViewDistance;                                         // 0x0308(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UOLD_ScalabilityOptions_C*                   BPWScalabilityOptions_OLDMENUASSET;                       // 0x0310(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_Slider_bpw_C*               BrightnessScale;                                          // 0x0318(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            FullscreenMode;                                           // 0x0320(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_Slider_bpw_C*               MotionBlur;                                               // 0x0328(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_PickerBox_bpw_C*            ResolutionPicker;                                         // 0x0330(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_Slider_bpw_C*               ResolutionScale;                                          // 0x0338(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class UScrollBox*                                  Video_ScrollBox;                                          // 0x0340(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	class Uw_Options_Entry_Toggle_bpw_C*               VSYNC;                                                    // 0x0348(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, RepNotify, Interp, NonTransactional, EditorOnly, NoDestructor, AutoWeak, ContainsInstancedReference, AssetRegistrySearchable, SimpleDisplay, AdvancedDisplay, Protected, BlueprintCallable, BlueprintAuthorityOnly, TextExportTransient, NonPIEDuplicateTransient, ExposeOnSpawn, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, NativeAccessSpecifierProtected, NativeAccessSpecifierPrivate)
	struct FScriptMulticastDelegate                    BackFrom_VideoOptions;                                    // 0x0350(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FScriptMulticastDelegate                    UpdateTooltip;                                            // 0x0360(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	struct FVideoOptions                               CurrentVideoOptions;                                      // 0x0370(0x0034) (Edit, BlueprintVisible)
	struct FVideoOptions                               StoredVideoOptions;                                       // 0x03A4(0x0034) (Edit, BlueprintVisible)
	struct FScriptMulticastDelegate                    FullScreenModeChanged;                                    // 0x03D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable)
	class UArchonOptionUserWidget*                     RootMenu;                                                 // 0x03E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("WidgetBlueprintGeneratedClass Options_Menu_VIDEO_bpw.Options_Menu_VIDEO_bpw_C");
		return ptr;
	}


	void SetQualityLevel(int NewQualityLevel, bool IsSubOption);
	void UpdateQualityLevel();
	void AreSettingsCustom(bool* Custom);
	void EnsureResolutionIsValid();
	void UpdateChildWidgetsforResolution(int fullscreen);
	void ApplyState(class UArchonOptionUserWidget* RootMenu, bool ForceUpdate);
	void HasStateChanged(bool* HasChanged);
	void UpdateUI();
	struct FEventReply OnKeyDown(struct FGeometry* MyGeometry, struct FKeyEvent* InKeyEvent);
	ESlateVisibility Get_ResolutionScale_Visibility();
	ESlateVisibility Get_ResolutionPicker_Visibility();
	void ResetToDefault();
	void SaveState();
	void RestoreState();
	void BndEvt__BrightnessScale_K2Node_ComponentBoundEvent_75_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__ResolutionScale_K2Node_ComponentBoundEvent_123_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__ResolutionScale_K2Node_ComponentBoundEvent_131_SliderValueChanged__DelegateSignature(float Value);
	void BndEvt__VSYNC_K2Node_ComponentBoundEvent_442_FocusReceived_Tooltip__DelegateSignature(const struct FText& Tooltip);
	void Gamepad_Cancel();
	void BndEvt__VSYNC_K2Node_ComponentBoundEvent_47_OptionToggleStateChange__DelegateSignature(ECheckBoxState State);
	void BndEvt__ADV_GraphicQuality_K2Node_ComponentBoundEvent_25_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__FullscreenMode_K2Node_ComponentBoundEvent_244_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__FullscreenMode_K2Node_ComponentBoundEvent_110_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__ResolutionPicker_K2Node_ComponentBoundEvent_122_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__ResolutionPicker_K2Node_ComponentBoundEvent_138_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__BrightnessScale_K2Node_ComponentBoundEvent_152_SliderValueChanged__DelegateSignature(float Value);
	void BndEvt__ADV_GraphicQuality_K2Node_ComponentBoundEvent_167_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__adv_ViewDistance_K2Node_ComponentBoundEvent_183_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__adv_ViewDistance_K2Node_ComponentBoundEvent_203_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__adv_AA_K2Node_ComponentBoundEvent_221_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__adv_AA_K2Node_ComponentBoundEvent_243_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__adv_PostProcess_K2Node_ComponentBoundEvent_263_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__adv_PostProcess_K2Node_ComponentBoundEvent_287_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__adv_Textures_K2Node_ComponentBoundEvent_309_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__adv_Textures_K2Node_ComponentBoundEvent_335_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__adv_Effects_K2Node_ComponentBoundEvent_359_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__adv_Effects_K2Node_ComponentBoundEvent_387_PickerUpdated__DelegateSignature(int PickerValue);
	void Construct();
	void BndEvt__adv_Shadows_K2Node_ComponentBoundEvent_292_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void BndEvt__adv_Shadows_K2Node_ComponentBoundEvent_319_PickerUpdated__DelegateSignature(int PickerValue);
	void BndEvt__MotionBlur_K2Node_ComponentBoundEvent_391_SliderValueChanged__DelegateSignature(float Value);
	void BndEvt__MotionBlur_K2Node_ComponentBoundEvent_419_FocusReceived__DelegateSignature(const struct FText& Tooltip);
	void ExecuteUbergraph_Options_Menu_VIDEO_bpw(int EntryPoint);
	void FullScreenModeChanged__DelegateSignature(int Mode);
	void UpdateTooltip__DelegateSignature(const struct FText& Tooltip);
	void BackFrom_VideoOptions__DelegateSignature();
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
