#pragma once

// Unreal Engine 4 (4) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "UE4_Basic.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct debug_capsuleinfo_struct.debug_capsuleinfo_struct
// 0x0020
struct Fdebug_capsuleinfo_struct
{
	float                                              Radius_2_83BE4F0B45FC1A9A9603648E481B5A59;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Height_9_3F2853224A0702D496F8FCA75C2A25B0;                // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotP_27_ED2BF6CC4245EA7BF4C9889B395D6308;                 // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotY_28_5F54E8BF499D7FC46E9F53867167DD13;                 // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              RotR_29_B2C325B74844ACAB8E3AAAB5ACF3562A;                 // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              X_37_C36FA1024E0323275F0B01B15CAB8A6D;                    // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Y_38_09F65A2240F2BFAB62F20584AA6DB319;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              Z_39_18FF3CC7469C3B2F2AAC83882FBC6A11;                    // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
